apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_otg_device.c
/****************************************************************************
 * arch/xtensa/src/esp32s3/esp32s3_otg_device.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/param.h>
#include <sys/types.h>
#include <inttypes.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdlib.h>
#include <string.h>
#include <assert.h>
#include <errno.h>
#include <nuttx/debug.h>

#include <nuttx/arch.h>
#include <nuttx/kmalloc.h>
#include <nuttx/usb/usb.h>
#include <nuttx/usb/usbdev.h>
#include <nuttx/usb/usbdev_trace.h>

#include <nuttx/irq.h>
#include <arch/board/board.h>

#include "xtensa.h"
#include "hardware/esp32s3_otg.h"
#include "hardware/esp32s3_system.h"
#include "hardware/esp32s3_gpio_sigmap.h"
#include "hardware/esp32s3_usb_wrap.h"
#include "soc/rtc_cntl_reg.h"
#include "hardware/esp32s3_pinmap.h"
#include "esp_gpio.h"
#include "esp_irq.h"
#include "esp32s3_otg.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Configuration ************************************************************/

/* USB hardware definition */

#define ESP32S3_FIFO_SIZE       (1280)
#define ESP32S3_FIFO_WORDS      (ESP32S3_FIFO_SIZE >> 2)

/* EP0 + additional EP */

#define ESP32S3_ENDPOINT_NUM    (CONFIG_ESP32S3_OTG_ENDPOINT_NUM + 1)

/* There is 1.25Kb of FIFO memory.  The default partitions this memory
 * so that there is a TxFIFO allocated for each endpoint and with more
 * memory provided for the common RxFIFO.  A more knowledge-able
 * configuration would not allocate any TxFIFO space to OUT endpoints.
 */

#define ESP32S3_TXFIFO_SIZE \
  (ESP32S3_FIFO_SIZE / 2 / ESP32S3_ENDPOINT_NUM * ESP32S3_ENDPOINT_NUM)

#define ESP32S3_EP_TXFIFO_SIZE \
  (ESP32S3_TXFIFO_SIZE / ESP32S3_ENDPOINT_NUM)

/* EP0 must exist */

#ifdef CONFIG_USBDEV_EP0_TXFIFO_SIZE
#  define ESP32S3_EP0_TXFIFO_SIZE CONFIG_USBDEV_EP0_TXFIFO_SIZE
#else
#  define ESP32S3_EP0_TXFIFO_SIZE ESP32S3_EP_TXFIFO_SIZE
#endif

#if ESP32S3_ENDPOINT_NUM > 1
#  ifdef CONFIG_USBDEV_EP1_TXFIFO_SIZE
#    define ESP32S3_EP1_TXFIFO_SIZE CONFIG_USBDEV_EP1_TXFIFO_SIZE
#  else
#    define ESP32S3_EP1_TXFIFO_SIZE ESP32S3_EP_TXFIFO_SIZE
#  endif
#else
#  define ESP32S3_EP1_TXFIFO_SIZE 0
#endif

#if ESP32S3_ENDPOINT_NUM > 2
#  ifdef CONFIG_USBDEV_EP2_TXFIFO_SIZE
#    define ESP32S3_EP2_TXFIFO_SIZE CONFIG_USBDEV_EP2_TXFIFO_SIZE
#  else
#    define ESP32S3_EP2_TXFIFO_SIZE ESP32S3_EP_TXFIFO_SIZE
#  endif
#else
#  define ESP32S3_EP2_TXFIFO_SIZE 0
#endif

#if ESP32S3_ENDPOINT_NUM > 3
#  ifdef CONFIG_USBDEV_EP3_TXFIFO_SIZE
#    define ESP32S3_EP3_TXFIFO_SIZE CONFIG_USBDEV_EP3_TXFIFO_SIZE
#  else
#    define ESP32S3_EP3_TXFIFO_SIZE ESP32S3_EP_TXFIFO_SIZE
#  endif
#else
#  define ESP32S3_EP3_TXFIFO_SIZE 0
#endif

#if ESP32S3_ENDPOINT_NUM > 4
#  ifdef CONFIG_USBDEV_EP4_TXFIFO_SIZE
#    define ESP32S3_EP4_TXFIFO_SIZE CONFIG_USBDEV_EP4_TXFIFO_SIZE
#  else
#    define ESP32S3_EP4_TXFIFO_SIZE ESP32S3_EP_TXFIFO_SIZE
#  endif
#else
#  define ESP32S3_EP4_TXFIFO_SIZE 0
#endif

#if ESP32S3_ENDPOINT_NUM > 5
#  ifdef CONFIG_USBDEV_EP5_TXFIFO_SIZE
#    define ESP32S3_EP5_TXFIFO_SIZE CONFIG_USBDEV_EP5_TXFIFO_SIZE
#  else
#    define ESP32S3_EP5_TXFIFO_SIZE ESP32S3_EP_TXFIFO_SIZE
#  endif
#else
#  define ESP32S3_EP5_TXFIFO_SIZE 0
#endif

#if ESP32S3_ENDPOINT_NUM > 6
#  ifdef CONFIG_USBDEV_EP6_TXFIFO_SIZE
#    define ESP32S3_EP6_TXFIFO_SIZE CONFIG_USBDEV_EP6_TXFIFO_SIZE
#  else
#    define ESP32S3_EP6_TXFIFO_SIZE ESP32S3_EP_TXFIFO_SIZE
#  endif
#else
#  define ESP32S3_EP6_TXFIFO_SIZE 0
#endif

/* The actual FIFO addresses that we use must be aligned to 4-byte
 * boundaries;
 * FIFO sizes must be provided in units of 32-bit words.
 */

#define ALIGN(v, a) (((v) + (a - 1)) & (~(a - 1)))

#define ESP32S3_EP0_TXFIFO_WORDS (ALIGN(ESP32S3_EP0_TXFIFO_SIZE, 4) >> 2)
#define ESP32S3_EP1_TXFIFO_WORDS (ALIGN(ESP32S3_EP1_TXFIFO_SIZE, 4) >> 2)
#define ESP32S3_EP2_TXFIFO_WORDS (ALIGN(ESP32S3_EP2_TXFIFO_SIZE, 4) >> 2)
#define ESP32S3_EP3_TXFIFO_WORDS (ALIGN(ESP32S3_EP3_TXFIFO_SIZE, 4) >> 2)
#define ESP32S3_EP4_TXFIFO_WORDS (ALIGN(ESP32S3_EP4_TXFIFO_SIZE, 4) >> 2)
#define ESP32S3_EP5_TXFIFO_WORDS (ALIGN(ESP32S3_EP5_TXFIFO_SIZE, 4) >> 2)
#define ESP32S3_EP6_TXFIFO_WORDS (ALIGN(ESP32S3_EP6_TXFIFO_SIZE, 4) >> 2)

#define ESP32S3_RXFIFO_WORDS  \
  (ESP32S3_FIFO_WORDS       - \
   ESP32S3_EP0_TXFIFO_WORDS - \
   ESP32S3_EP1_TXFIFO_WORDS - \
   ESP32S3_EP2_TXFIFO_WORDS - \
   ESP32S3_EP3_TXFIFO_WORDS - \
   ESP32S3_EP4_TXFIFO_WORDS - \
   ESP32S3_EP5_TXFIFO_WORDS - \
   ESP32S3_EP6_TXFIFO_WORDS)

#if (ESP32S3_RXFIFO_WORDS * 4) < 64
#  error "ESP32-S3 OTG device RX FIFO size should >= 64"
#endif

/* EP0 max packet size */

#define ESP32S3_CDCACM_EP0MAXPACKET CONFIG_CDCACM_EP0MAXPACKET

#define OTG_GINT_RESERVED_FS   (OTG_GINT_RES89    | \
                                OTG_GINT_RES1617  | \
                                OTG_GINT_RES22)

#define OTG_GINT_RC_W1_FS      (OTG_GINT_MMIS     | \
                                OTG_GINT_SOF      | \
                                OTG_GINT_ESUSP    | \
                                OTG_GINT_USBSUSP  | \
                                OTG_GINT_USBRST   | \
                                OTG_GINT_ENUMDNE  | \
                                OTG_GINT_ISOODRP  | \
                                OTG_GINT_EOPF     | \
                                OTG_GINT_IISOIXFR | \
                                OTG_GINT_IISOOXFR | \
                                OTG_GINT_RSTDET   | \
                                OTG_GINT_LPMINT   | \
                                OTG_GINT_CIDSCHG  | \
                                OTG_GINT_DISC     | \
                                OTG_GINT_SRQ      | \
                                OTG_GINT_WKUP)

#define OTG_GINT_RESERVED       OTG_GINT_RESERVED_FS
#define OTG_GINT_RC_W1          OTG_GINT_RC_W1_FS

/* Debug ********************************************************************/

