apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_otg_device.c
/* Trace error codes */

#define ESP32S3_TRACEERR_ALLOCFAIL          0x01
#define ESP32S3_TRACEERR_BADCLEARFEATURE    0x02
#define ESP32S3_TRACEERR_BADDEVGETSTATUS    0x03
#define ESP32S3_TRACEERR_BADEPNO            0x04
#define ESP32S3_TRACEERR_BADEPGETSTATUS     0x05
#define ESP32S3_TRACEERR_BADGETCONFIG       0x06
#define ESP32S3_TRACEERR_BADGETSETDESC      0x07
#define ESP32S3_TRACEERR_BADGETSTATUS       0x08
#define ESP32S3_TRACEERR_BADSETADDRESS      0x09
#define ESP32S3_TRACEERR_BADSETCONFIG       0x0a
#define ESP32S3_TRACEERR_BADSETFEATURE      0x0b
#define ESP32S3_TRACEERR_BADTESTMODE        0x0c
#define ESP32S3_TRACEERR_BINDFAILED         0x0d
#define ESP32S3_TRACEERR_DISPATCHSTALL      0x0e
#define ESP32S3_TRACEERR_DRIVER             0x0f
#define ESP32S3_TRACEERR_DRIVERREGISTERED   0x10
#define ESP32S3_TRACEERR_EP0NOSETUP         0x11
#define ESP32S3_TRACEERR_EP0SETUPSTALLED    0x12
#define ESP32S3_TRACEERR_EPINNULLPACKET     0x13
#define ESP32S3_TRACEERR_EPINUNEXPECTED     0x14
#define ESP32S3_TRACEERR_EPOUTNULLPACKET    0x15
#define ESP32S3_TRACEERR_EPOUTUNEXPECTED    0x16
#define ESP32S3_TRACEERR_INVALIDCTRLREQ     0x17
#define ESP32S3_TRACEERR_INVALIDPARMS       0x18
#define ESP32S3_TRACEERR_IRQREGISTRATION    0x19
#define ESP32S3_TRACEERR_NOEP               0x1a
#define ESP32S3_TRACEERR_NOTCONFIGURED      0x1b
#define ESP32S3_TRACEERR_EPOUTQEMPTY        0x1c
#define ESP32S3_TRACEERR_EPINREQEMPTY       0x1d
#define ESP32S3_TRACEERR_NOOUTSETUP         0x1e
#define ESP32S3_TRACEERR_POLLTIMEOUT        0x1f

/* Trace interrupt codes */

#define ESP32S3_TRACEINTID_USB              1 /* USB Interrupt entry/exit */
#define ESP32S3_TRACEINTID_INTPENDING       2 /* On each pass through the loop */

#define ESP32S3_TRACEINTID_EPOUT            (10 + 0)  /* First level interrupt decode */
#define ESP32S3_TRACEINTID_EPIN             (10 + 1)
#define ESP32S3_TRACEINTID_MISMATCH         (10 + 2)
#define ESP32S3_TRACEINTID_WAKEUP           (10 + 3)
#define ESP32S3_TRACEINTID_SUSPEND          (10 + 4)
#define ESP32S3_TRACEINTID_SOF              (10 + 5)
#define ESP32S3_TRACEINTID_RXFIFO           (10 + 6)
#define ESP32S3_TRACEINTID_DEVRESET         (10 + 7)
#define ESP32S3_TRACEINTID_ENUMDNE          (10 + 8)
#define ESP32S3_TRACEINTID_IISOIXFR         (10 + 9)
#define ESP32S3_TRACEINTID_IISOOXFR         (10 + 10)
#define ESP32S3_TRACEINTID_SRQ              (10 + 11)
#define ESP32S3_TRACEINTID_OTG              (10 + 12)

#define ESP32S3_TRACEINTID_EPOUT_XFRC       (40 + 0)  /* EPOUT second level decode */
#define ESP32S3_TRACEINTID_EPOUT_EPDISD     (40 + 1)
#define ESP32S3_TRACEINTID_EPOUT_SETUP      (40 + 2)
#define ESP32S3_TRACEINTID_DISPATCH         (40 + 3)

#define ESP32S3_TRACEINTID_GETSTATUS        (50 + 0)  /* EPOUT third level decode */
#define ESP32S3_TRACEINTID_EPGETSTATUS      (50 + 1)
#define ESP32S3_TRACEINTID_DEVGETSTATUS     (50 + 2)
#define ESP32S3_TRACEINTID_IFGETSTATUS      (50 + 3)
#define ESP32S3_TRACEINTID_CLEARFEATURE     (50 + 4)
#define ESP32S3_TRACEINTID_SETFEATURE       (50 + 5)
#define ESP32S3_TRACEINTID_SETADDRESS       (50 + 6)
#define ESP32S3_TRACEINTID_GETSETDESC       (50 + 7)
#define ESP32S3_TRACEINTID_GETCONFIG        (50 + 8)
#define ESP32S3_TRACEINTID_SETCONFIG        (50 + 9)
#define ESP32S3_TRACEINTID_GETSETIF         (50 + 10)
#define ESP32S3_TRACEINTID_SYNCHFRAME       (50 + 11)

#define ESP32S3_TRACEINTID_EPIN_XFRC        (70 + 0)  /* EPIN second level decode */
#define ESP32S3_TRACEINTID_EPIN_TOC         (70 + 1)
#define ESP32S3_TRACEINTID_EPIN_ITTXFE      (70 + 2)
#define ESP32S3_TRACEINTID_EPIN_EPDISD      (70 + 3)
#define ESP32S3_TRACEINTID_EPIN_TXFE        (70 + 4)

#define ESP32S3_TRACEINTID_EPIN_EMPWAIT     (80 + 0)  /* EPIN second level decode */

#define ESP32S3_TRACEINTID_OUTNAK           (90 + 0)  /* RXFLVL second level decode */
#define ESP32S3_TRACEINTID_OUTRECVD         (90 + 1)
#define ESP32S3_TRACEINTID_OUTDONE          (90 + 2)
#define ESP32S3_TRACEINTID_SETUPDONE        (90 + 3)
#define ESP32S3_TRACEINTID_SETUPRECVD       (90 + 4)

/* Endpoints ****************************************************************/

/* Odd physical endpoint numbers are IN; even are OUT */

#define ESP32S3_EPPHYIN2LOG(epphy)    ((uint8_t)(epphy) | USB_DIR_IN)
#define ESP32S3_EPPHYOUT2LOG(epphy)   ((uint8_t)(epphy) | USB_DIR_OUT)

/* Endpoint 0 */

#define EP0                           (0)

/* The set of all endpoints available to the class implementation (1-3) */

#define ESP32S3_EP_AVAILABLE          (0xfe)   /* All available endpoints */

/* Delays *******************************************************************/

#define ESP32S3_READY_DELAY           200000
#define ESP32S3_FLUSH_DELAY           200000

/* Request queue operations *************************************************/

#define esp32s3_rqempty(ep)           ((ep)->head == NULL)
#define esp32s3_rqpeek(ep)            ((ep)->head)

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* Overall device state */

enum esp32s3_devstate_e
{
  DEVSTATE_DEFAULT = 0,       /* Power-up, unconfigured state.  This state
                               * simply means that the device is not yet been
                               * given an address.  SET: At initialization,
                               * uninitialization, reset, and whenever the
                               * device address is set to zero TESTED: Never */
  DEVSTATE_ADDRESSED,         /* Device address has been assigned, not no
                               * configuration has yet been selected.  SET:
                               * When either a non-zero device address is
                               * first assigned or when the device is
                               * unconfigured (with configuration == 0)
                               * TESTED: never */
  DEVSTATE_CONFIGURED,        /* Address assigned and configured: SET: When
                               * the device has been addressed and an
                               * non-zero configuration has been selected.
                               * TESTED: In many places to assure that the
                               * USB device has been properly configured by
                               * the host. */
};

/* Endpoint 0 states */

enum esp32s3_ep0state_e
{
  EP0STATE_IDLE = 0,          /* Idle State, leave on receiving a SETUP
                               * packet or epsubmit: SET: In esp32s3_epin() and
                               * esp32s3_epout() when we revert from request
                               * processing to SETUP processing.  TESTED:
                               * Never */
  EP0STATE_SETUP_OUT,         /* OUT SETUP packet received.  Waiting for the
                               * DATA OUT phase of SETUP Packet to complete
                               * before processing a SETUP command (without a
                               * USB request): SET: Set in
                               * esp32s3_rxinterrupt() when SETUP OUT packet is
                               * received.  TESTED: In esp32s3_ep0out_receive() */
  EP0STATE_SETUP_READY,       /* IN SETUP packet received -OR- OUT SETUP
                               * packet and accompanying data have been
                               * received.  Processing of SETUP command will
                               * happen soon.  SET: (1)
                               * esp32s3_ep0out_receive() when the OUT SETUP
                               * data phase completes, or (2)
                               * esp32s3_rxinterrupt() when an IN SETUP is
                               * packet received.  TESTED: Tested in
                               * esp32s3_epout_interrupt() when SETUP phase is
                               * done to see if the SETUP command is ready to
                               * be processed.  Also tested in
                               * esp32s3_ep0out_setup() just to double-check
                               * that we have a SETUP request and any
                               * accompanying data. */
  EP0STATE_SETUP_PROCESS,     /* SETUP Packet is being processed by
                               * esp32s3_ep0out_setup(): SET: When SETUP packet
                               * received in EP0 OUT TESTED: Never */
  EP0STATE_SETUPRESPONSE,     /* Short SETUP response write (without a USB
                               * request): SET: When SETUP response is sent
                               * by esp32s3_ep0in_setupresponse() TESTED: Never */
  EP0STATE_DATA_IN,           /* Waiting for data out stage (with a USB
                               * request): SET: In esp32s3_epin_request() when
                               * a write request is processed on EP0.
                               * TESTED: In esp32s3_epin() to see if we should
                               * revert to SETUP processing. */
  EP0STATE_DATA_OUT           /* Waiting for data in phase to complete ( with
                               * a USB request) SET: In esp32s3_epout_request()
                               * when a read request is processed on EP0.
                               * TESTED: In esp32s3_epout() to see if we should
                               * revert to SETUP processing */
};

/* Parsed control request */

struct esp32s3_ctrlreq_s
{
  uint8_t type;
  uint8_t req;
  uint16_t value;
  uint16_t index;
  uint16_t len;
};

/* A container for a request so that the request may be retained in a list */

struct esp32s3_req_s
{
  struct usbdev_req_s req;      /* Standard USB request */
  struct esp32s3_req_s *flink;  /* Supports a singly linked list */
};

/* This is the internal representation of an endpoint */

struct esp32s3_ep_s
{
  /* Common endpoint fields.  This must be the first thing defined in the
   * structure so that it is possible to simply cast from struct usbdev_ep_s
   * to struct esp32s3_ep_s.
   */

  struct usbdev_ep_s ep;      /* Standard endpoint structure */

  /* ESP32-S3-specific fields */

  struct esp32s3_usbdev_s *dev; /* Reference to private driver data */
  struct esp32s3_req_s *head;   /* Request list for this endpoint */
  struct esp32s3_req_s *tail;
  uint8_t epphy;                /* Physical EP address */
  uint8_t eptype:2;             /* Endpoint type */
  uint8_t active:1;             /* 1: A request is being processed */
  uint8_t stalled:1;            /* 1: Endpoint is stalled */
  uint8_t isin:1;               /* 1: IN Endpoint */
  uint8_t odd:1;                /* 1: Odd frame */
  uint8_t zlp:1;                /* 1: Transmit a zero-length-packet (IN EPs only) */
};

/* This structure retains the state of the USB device controller */

struct esp32s3_usbdev_s
{
  /* Common device fields.  This must be the first thing defined in the
   * structure so that it is possible to simply cast from struct usbdev_s to
   * struct esp32s3_usbdev_s.
   */

  struct usbdev_s usbdev;

  /* The bound device class driver */

  struct usbdevclass_driver_s *driver;

  /* ESP32-S3-specific fields */

  int cpu;                    /* CPU ID */
  int cpuint;                 /* OTG interrupt ID */

  uint8_t stalled:1;          /* 1: Protocol stalled */
  uint8_t selfpowered:1;      /* 1: Device is self powered */
  uint8_t addressed:1;        /* 1: Peripheral address has been set */
  uint8_t configured:1;       /* 1: Class driver has been configured */
  uint8_t wakeup:1;           /* 1: Device remote wake-up */
  uint8_t dotest:1;           /* 1: Test mode selected */

  uint8_t devstate:4;         /* See enum esp32s3_devstate_e */
  uint8_t ep0state:4;         /* See enum esp32s3_ep0state_e */
  uint8_t testmode:4;         /* Selected test mode */
  uint8_t epavail[2];         /* Bitset of available OUT/IN endpoints */

  /* E0 SETUP data buffering.
   *
   * ctrlreq:
   *   The 8-byte SETUP request is received on the EP0 OUT endpoint and is
   *   saved.
   *
   * ep0data:
   *   For OUT SETUP requests, the SETUP data phase must also complete
   *   before the SETUP command can be processed.  The pack receipt logic
   *   will save the accompanying EP0 IN data in ep0data[] before the
   *   SETUP command is processed.
   *
   *   For IN SETUP requests, the DATA phase will occur AFTER the SETUP
   *   control request is processed.  In that case, ep0data[] may be used
   *   as the response buffer.
   *
   * ep0datlen:
   *   Length of OUT DATA received in ep0data[] (Not used with OUT data)
   */

  struct usb_ctrlreq_s ctrlreq;
  uint8_t ep0data[ESP32S3_CDCACM_EP0MAXPACKET];
  uint16_t ep0datlen;

  /* The endpoint lists */

  struct esp32s3_ep_s epin[ESP32S3_ENDPOINT_NUM];
  struct esp32s3_ep_s epout[ESP32S3_ENDPOINT_NUM];
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

