apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_otg_device.c
/* Register operations ******************************************************/

#ifdef CONFIG_ESP32S3_OTG_DEBUG_REGISTER
static uint32_t esp32s3_getreg(uint32_t addr);
static void esp32s3_putreg(uint32_t val, uint32_t addr);
#else
#  define esp32s3_getreg(addr)     getreg32(addr)
#  define esp32s3_putreg(val,addr) putreg32(val,addr)
#endif

/* Request queue operations *************************************************/

static struct esp32s3_req_s *esp32s3_req_remfirst(struct esp32s3_ep_s
                                                  *privep);
static bool esp32s3_req_addlast(struct esp32s3_ep_s *privep,
                                struct esp32s3_req_s *req);

/* Low level data transfers and request operations **************************/

/* Special endpoint 0 data transfer logic */

static void esp32s3_ep0in_setupresponse(struct esp32s3_usbdev_s *priv,
                                        uint8_t * data, uint32_t nbytes);
static inline void esp32s3_ep0in_transmitzlp(struct esp32s3_usbdev_s *priv);
static void esp32s3_ep0in_activate(void);

static void esp32s3_ep0out_ctrlsetup(struct esp32s3_usbdev_s *priv);

/* IN request and TxFIFO handling */

static void esp32s3_txfifo_write(struct esp32s3_ep_s *privep,
                                 uint8_t *buf, int nbytes);
static void esp32s3_epin_transfer(struct esp32s3_ep_s *privep,
                                  uint8_t *buf, int nbytes);
static void esp32s3_epin_request(struct esp32s3_usbdev_s *priv,
                                 struct esp32s3_ep_s *privep);

/* OUT request and RxFIFO handling */

static void esp32s3_rxfifo_read(struct esp32s3_ep_s *privep,
                                uint8_t * dest, uint16_t len);
static void esp32s3_rxfifo_discard(struct esp32s3_ep_s *privep, int len);
static void esp32s3_epout_complete(struct esp32s3_usbdev_s *priv,
                                   struct esp32s3_ep_s *privep);
static inline void esp32s3_ep0out_receive(struct esp32s3_ep_s *privep,
                                          int bcnt);
static inline void esp32s3_epout_receive(struct esp32s3_ep_s *privep,
                                         int bcnt);
static void esp32s3_epout_request(struct esp32s3_usbdev_s *priv,
                                  struct esp32s3_ep_s *privep);

/* General request handling */

static void esp32s3_ep_flush(struct esp32s3_ep_s *privep);
static void esp32s3_req_complete(struct esp32s3_ep_s *privep,
                                 int16_t result);
static void esp32s3_req_cancel(struct esp32s3_ep_s *privep, int16_t status);

/* Interrupt handling *******************************************************/

static struct esp32s3_ep_s *esp32s3_ep_findbyaddr(
                                struct esp32s3_usbdev_s *priv,
                                uint16_t eplog);
static int esp32s3_req_dispatch(struct esp32s3_usbdev_s *priv,
                                const struct usb_ctrlreq_s *ctrl);
static void esp32s3_usbreset(struct esp32s3_usbdev_s *priv);

/* Second level OUT endpoint interrupt processing */

static inline void esp32s3_ep0out_testmode(struct esp32s3_usbdev_s *priv,
                                           uint16_t index);
static inline void esp32s3_ep0out_stdrequest(
                        struct esp32s3_usbdev_s *priv,
                        struct esp32s3_ctrlreq_s *ctrlreq);
static inline void esp32s3_ep0out_setup(struct esp32s3_usbdev_s *priv);
static inline void esp32s3_epout(struct esp32s3_usbdev_s *priv,
                                 uint8_t epno);
static inline void esp32s3_epout_interrupt(struct esp32s3_usbdev_s *priv);

/* Second level IN endpoint interrupt processing */

static inline void esp32s3_epin_runtestmode(struct esp32s3_usbdev_s *priv);
static inline void esp32s3_epin(struct esp32s3_usbdev_s *priv, uint8_t epno);
static inline void esp32s3_epin_txfifoempty(struct esp32s3_usbdev_s *priv,
                                            int epno);
static inline void esp32s3_epin_interrupt(struct esp32s3_usbdev_s *priv);

/* Other second level interrupt processing */

static inline void esp32s3_resumeinterrupt(struct esp32s3_usbdev_s *priv);
static inline void esp32s3_suspendinterrupt(struct esp32s3_usbdev_s *priv);
static inline void esp32s3_rxinterrupt(struct esp32s3_usbdev_s *priv);
static inline void esp32s3_enuminterrupt(struct esp32s3_usbdev_s *priv);
#ifdef CONFIG_USBDEV_ISOCHRONOUS
static inline void esp32s3_isocininterrupt(struct esp32s3_usbdev_s *priv);
static inline void esp32s3_isocoutinterrupt(struct esp32s3_usbdev_s *priv);
#endif
#ifdef CONFIG_USBDEV_VBUSSENSING
static inline void esp32s3_sessioninterrupt(struct esp32s3_usbdev_s *priv);
static inline void esp32s3_otginterrupt(struct esp32s3_usbdev_s *priv);
#endif

/* First level interrupt processing */

static int esp32s3_usbinterrupt(int irq, void *context, void *arg);

/* Endpoint operations ******************************************************/

/* Global OUT NAK controls */

static void esp32s3_enablegonak(struct esp32s3_ep_s *privep);
static void esp32s3_disablegonak(struct esp32s3_ep_s *privep);

/* Endpoint configuration */

static int esp32s3_epout_configure(struct esp32s3_ep_s *privep,
                                   uint8_t eptype, uint16_t maxpacket);
static int esp32s3_epin_configure(struct esp32s3_ep_s *privep,
                                  uint8_t eptype, uint16_t maxpacket);
static int esp32s3_ep_configure(struct usbdev_ep_s *ep,
                                const struct usb_epdesc_s *desc,
                                bool last);
static void esp32s3_ep0_configure(struct esp32s3_usbdev_s *priv);

/* Endpoint disable */

static void esp32s3_epout_disable(struct esp32s3_ep_s *privep);
static void esp32s3_epin_disable(struct esp32s3_ep_s *privep);
static int esp32s3_ep_disable(struct usbdev_ep_s *ep);

/* Endpoint request management */

static struct usbdev_req_s *esp32s3_ep_allocreq(
                                struct usbdev_ep_s *ep);
static void esp32s3_ep_freereq(struct usbdev_ep_s *ep,
                               struct usbdev_req_s *);

/* Endpoint buffer management */

#ifdef CONFIG_USBDEV_DMA
static void *esp32s3_ep_allocbuffer(struct usbdev_ep_s *ep,
                                    uint16_t bytes);
static void esp32s3_ep_freebuffer(struct usbdev_ep_s *ep, void *buf);
#endif

