apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_otg_device.c
/* Endpoint request submission */

static int esp32s3_ep_submit(struct usbdev_ep_s *ep,
                             struct usbdev_req_s *req);

/* Endpoint request cancellation */

static int esp32s3_ep_cancel(struct usbdev_ep_s *ep,
                             struct usbdev_req_s *req);

/* Stall handling */

static int esp32s3_epout_setstall(struct esp32s3_ep_s *privep);
static int esp32s3_epin_setstall(struct esp32s3_ep_s *privep);
static int esp32s3_ep_setstall(struct esp32s3_ep_s *privep);
static int esp32s3_ep_clrstall(struct esp32s3_ep_s *privep);
static int esp32s3_ep_stall(struct usbdev_ep_s *ep, bool resume);
static void esp32s3_ep0_stall(struct esp32s3_usbdev_s *priv);

/* Endpoint allocation */

static struct usbdev_ep_s *esp32s3_ep_alloc(struct usbdev_s *dev,
                                            uint8_t epno, bool in,
                                            uint8_t eptype);
static void esp32s3_ep_free(struct usbdev_s *dev,
                            struct usbdev_ep_s *ep);

/* USB device controller operations *****************************************/

static int esp32s3_getframe(struct usbdev_s *dev);
static int esp32s3_wakeup(struct usbdev_s *dev);
static int esp32s3_selfpowered(struct usbdev_s *dev, bool selfpowered);
static int esp32s3_pullup(struct usbdev_s *dev, bool enable);
static void esp32s3_setaddress(struct esp32s3_usbdev_s *priv,
                               uint16_t address);
static int esp32s3_txfifo_flush(uint32_t txfnum);
static int esp32s3_rxfifo_flush(void);

/* Initialization ***********************************************************/

static void esp32s3_swinitialize(struct esp32s3_usbdev_s *priv);
static void esp32s3_hwinitialize(struct esp32s3_usbdev_s *priv);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* Since there is only a single USB interface, all status information can be
 * be simply retained in a single global instance.
 */

static struct esp32s3_usbdev_s g_otghsdev;

static const struct usbdev_epops_s g_epops =
{
  .configure = esp32s3_ep_configure,
  .disable = esp32s3_ep_disable,
  .allocreq = esp32s3_ep_allocreq,
  .freereq = esp32s3_ep_freereq,
#ifdef CONFIG_USBDEV_DMA
  .allocbuffer = esp32s3_ep_allocbuffer,
  .freebuffer = esp32s3_ep_freebuffer,
#endif
  .submit = esp32s3_ep_submit,
  .cancel = esp32s3_ep_cancel,
  .stall = esp32s3_ep_stall,
};

static const struct usbdev_ops_s g_devops =
{
  .allocep = esp32s3_ep_alloc,
  .freeep = esp32s3_ep_free,
  .getframe = esp32s3_getframe,
  .wakeup = esp32s3_wakeup,
  .selfpowered = esp32s3_selfpowered,
  .pullup = esp32s3_pullup,
};

/* Device error strings that may be enabled for more descriptive USB trace
 * output.
 */

#ifdef CONFIG_USBDEV_TRACE_STRINGS
const struct trace_msg_t g_usb_trace_strings_deverror[] =
{
  TRACE_STR(ESP32S3_TRACEERR_ALLOCFAIL),
  TRACE_STR(ESP32S3_TRACEERR_BADCLEARFEATURE),
  TRACE_STR(ESP32S3_TRACEERR_BADDEVGETSTATUS),
  TRACE_STR(ESP32S3_TRACEERR_BADEPNO),
  TRACE_STR(ESP32S3_TRACEERR_BADEPGETSTATUS),
  TRACE_STR(ESP32S3_TRACEERR_BADGETCONFIG),
  TRACE_STR(ESP32S3_TRACEERR_BADGETSETDESC),
  TRACE_STR(ESP32S3_TRACEERR_BADGETSTATUS),
  TRACE_STR(ESP32S3_TRACEERR_BADSETADDRESS),
  TRACE_STR(ESP32S3_TRACEERR_BADSETCONFIG),
  TRACE_STR(ESP32S3_TRACEERR_BADSETFEATURE),
  TRACE_STR(ESP32S3_TRACEERR_BADTESTMODE),
  TRACE_STR(ESP32S3_TRACEERR_BINDFAILED),
  TRACE_STR(ESP32S3_TRACEERR_DISPATCHSTALL),
  TRACE_STR(ESP32S3_TRACEERR_DRIVER),
  TRACE_STR(ESP32S3_TRACEERR_DRIVERREGISTERED),
  TRACE_STR(ESP32S3_TRACEERR_EP0NOSETUP),
  TRACE_STR(ESP32S3_TRACEERR_EP0SETUPSTALLED),
  TRACE_STR(ESP32S3_TRACEERR_EPINNULLPACKET),
  TRACE_STR(ESP32S3_TRACEERR_EPINUNEXPECTED),
  TRACE_STR(ESP32S3_TRACEERR_EPOUTNULLPACKET),
  TRACE_STR(ESP32S3_TRACEERR_EPOUTUNEXPECTED),
  TRACE_STR(ESP32S3_TRACEERR_INVALIDCTRLREQ),
  TRACE_STR(ESP32S3_TRACEERR_INVALIDPARMS),
  TRACE_STR(ESP32S3_TRACEERR_IRQREGISTRATION),
  TRACE_STR(ESP32S3_TRACEERR_NOEP),
  TRACE_STR(ESP32S3_TRACEERR_NOTCONFIGURED),
  TRACE_STR(ESP32S3_TRACEERR_EPOUTQEMPTY),
  TRACE_STR(ESP32S3_TRACEERR_EPINREQEMPTY),
  TRACE_STR(ESP32S3_TRACEERR_NOOUTSETUP),
  TRACE_STR(ESP32S3_TRACEERR_POLLTIMEOUT),
  TRACE_STR_END
};
#endif

/* Interrupt event strings that may be enabled for more descriptive USB trace
 * output.
 */

#ifdef CONFIG_USBDEV_TRACE_STRINGS
const struct trace_msg_t g_usb_trace_strings_intdecode[] =
{
  TRACE_STR(ESP32S3_TRACEINTID_USB),
  TRACE_STR(ESP32S3_TRACEINTID_INTPENDING),
  TRACE_STR(ESP32S3_TRACEINTID_EPOUT),
  TRACE_STR(ESP32S3_TRACEINTID_EPIN),
  TRACE_STR(ESP32S3_TRACEINTID_MISMATCH),
  TRACE_STR(ESP32S3_TRACEINTID_WAKEUP),
  TRACE_STR(ESP32S3_TRACEINTID_SUSPEND),
  TRACE_STR(ESP32S3_TRACEINTID_SOF),
  TRACE_STR(ESP32S3_TRACEINTID_RXFIFO),
  TRACE_STR(ESP32S3_TRACEINTID_DEVRESET),
  TRACE_STR(ESP32S3_TRACEINTID_ENUMDNE),
  TRACE_STR(ESP32S3_TRACEINTID_IISOIXFR),
  TRACE_STR(ESP32S3_TRACEINTID_IISOOXFR),
  TRACE_STR(ESP32S3_TRACEINTID_SRQ),
  TRACE_STR(ESP32S3_TRACEINTID_OTG),
  TRACE_STR(ESP32S3_TRACEINTID_EPOUT_XFRC),
  TRACE_STR(ESP32S3_TRACEINTID_EPOUT_EPDISD),
  TRACE_STR(ESP32S3_TRACEINTID_EPOUT_SETUP),
  TRACE_STR(ESP32S3_TRACEINTID_DISPATCH),
  TRACE_STR(ESP32S3_TRACEINTID_GETSTATUS),
  TRACE_STR(ESP32S3_TRACEINTID_EPGETSTATUS),
  TRACE_STR(ESP32S3_TRACEINTID_DEVGETSTATUS),
  TRACE_STR(ESP32S3_TRACEINTID_IFGETSTATUS),
  TRACE_STR(ESP32S3_TRACEINTID_CLEARFEATURE),
  TRACE_STR(ESP32S3_TRACEINTID_SETFEATURE),
  TRACE_STR(ESP32S3_TRACEINTID_SETADDRESS),
  TRACE_STR(ESP32S3_TRACEINTID_GETSETDESC),
  TRACE_STR(ESP32S3_TRACEINTID_GETCONFIG),
  TRACE_STR(ESP32S3_TRACEINTID_SETCONFIG),
  TRACE_STR(ESP32S3_TRACEINTID_GETSETIF),
  TRACE_STR(ESP32S3_TRACEINTID_SYNCHFRAME),
  TRACE_STR(ESP32S3_TRACEINTID_EPIN_XFRC),
  TRACE_STR(ESP32S3_TRACEINTID_EPIN_TOC),
  TRACE_STR(ESP32S3_TRACEINTID_EPIN_ITTXFE),
  TRACE_STR(ESP32S3_TRACEINTID_EPIN_EPDISD),
  TRACE_STR(ESP32S3_TRACEINTID_EPIN_TXFE),
  TRACE_STR(ESP32S3_TRACEINTID_EPIN_EMPWAIT),
  TRACE_STR(ESP32S3_TRACEINTID_OUTNAK),
  TRACE_STR(ESP32S3_TRACEINTID_OUTRECVD),
  TRACE_STR(ESP32S3_TRACEINTID_OUTDONE),
  TRACE_STR(ESP32S3_TRACEINTID_SETUPDONE),
  TRACE_STR(ESP32S3_TRACEINTID_SETUPRECVD),
  TRACE_STR_END
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp32s3_getreg
 *
 * Description:
 *   Get the contents of an ESP32-S3 register
 *
 ****************************************************************************/

#ifdef CONFIG_ESP32S3_OTG_DEBUG_REGISTER
static uint32_t esp32s3_getreg(uint32_t addr)
{
  static uint32_t prevaddr = 0;
  static uint32_t preval = 0;
  static uint32_t count = 0;

  /* Read the value from the register */

  uint32_t val = getreg32(addr);

  /* Is this the same value that we read from the same register last time?
   * Are we polling the register? If so, suppress some of the output.
   */

  if (addr == prevaddr && val == preval)
    {
      if (count == 0xffffffff || ++count > 3)
        {
          if (count == 4)
            {
              uinfo("...\n");
            }

          return val;
        }
    }

  /* No this is a new address or value */

  else
    {
      /* Did we print "..." for the previous value? */

