apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_otg_device.c
      if (count > 3)
        {
          /* Yes.. then show how many times the value repeated */

          uinfo("[repeats %d more times]\n", count - 3);
        }

      /* Save the new address, value, and count */

      prevaddr = addr;
      preval = val;
      count = 1;
    }

  /* Show the register value read */

  uinfo("%08x->%08x\n", addr, val);
  return val;
}
#endif

/****************************************************************************
 * Name: esp32s3_putreg
 *
 * Description:
 *   Set the contents of an ESP32-S3 register to a value
 *
 ****************************************************************************/

#ifdef CONFIG_ESP32S3_OTG_DEBUG_REGISTER
static void esp32s3_putreg(uint32_t val, uint32_t addr)
{
  /* Show the register value being written */

  uinfo("%08x<-%08x\n", addr, val);

  /* Write the value */

  putreg32(val, addr);
}
#endif

/****************************************************************************
 * Name: esp32s3_req_remfirst
 *
 * Description:
 *   Remove a request from the head of an endpoint request queue
 *
 ****************************************************************************/

static struct esp32s3_req_s *esp32s3_req_remfirst(
                                struct esp32s3_ep_s *privep)
{
  struct esp32s3_req_s *ret = privep->head;

  if (ret)
    {
      privep->head = ret->flink;
      if (!privep->head)
        {
          privep->tail = NULL;
        }

      ret->flink = NULL;
    }

  return ret;
}

/****************************************************************************
 * Name: esp32s3_req_addlast
 *
 * Description:
 *   Add a request to the end of an endpoint request queue
 *
 ****************************************************************************/

static bool esp32s3_req_addlast(struct esp32s3_ep_s *privep,
                                struct esp32s3_req_s *req)
{
  bool is_empty = !privep->head;

  req->flink = NULL;
  if (is_empty)
    {
      privep->head = req;
      privep->tail = req;
    }
  else
    {
      privep->tail->flink = req;
      privep->tail = req;
    }

  return is_empty;
}

/****************************************************************************
 * Name: esp32s3_ep0in_setupresponse
 *
 * Description:
 *   Schedule a short transfer on Endpoint 0 (IN or OUT)
 *
 ****************************************************************************/

static void esp32s3_ep0in_setupresponse(struct esp32s3_usbdev_s *priv,
                                        uint8_t *buf,
                                        uint32_t nbytes)
{
  esp32s3_epin_transfer(&priv->epin[EP0], buf, nbytes);
  priv->ep0state = EP0STATE_SETUPRESPONSE;
  esp32s3_ep0out_ctrlsetup(priv);
}

/****************************************************************************
 * Name: esp32s3_ep0in_transmitzlp
 *
 * Description:
 *   Send a zero length packet (ZLP) on endpoint 0 IN
 *
 ****************************************************************************/

static inline void esp32s3_ep0in_transmitzlp(struct esp32s3_usbdev_s *priv)
{
  esp32s3_ep0in_setupresponse(priv, NULL, 0);
}

/****************************************************************************
 * Name: esp32s3_ep0in_activate
 *
 * Description:
 *   Activate the endpoint 0 IN endpoint.
 *
 ****************************************************************************/

static void esp32s3_ep0in_activate(void)
{
  uint32_t regval;

  /* Set the max packet size of the IN EP. */

  regval = esp32s3_getreg(ESP32S3_OTG_DIEPCTL(0));
  regval &= ~OTG_DIEPCTL0_MPSIZ_MASK;

#if ESP32S3_CDCACM_EP0MAXPACKET == 8
  regval |= OTG_DIEPCTL0_MPSIZ_8;
#elif ESP32S3_CDCACM_EP0MAXPACKET == 16
  regval |= OTG_DIEPCTL0_MPSIZ_16;
#elif ESP32S3_CDCACM_EP0MAXPACKET == 32
  regval |= OTG_DIEPCTL0_MPSIZ_32;
#elif ESP32S3_CDCACM_EP0MAXPACKET == 64
  regval |= OTG_DIEPCTL0_MPSIZ_64;
#else
#  error "Unsupported value of ESP32S3_CDCACM_EP0MAXPACKET"
#endif

  esp32s3_putreg(regval, ESP32S3_OTG_DIEPCTL(0));

  /* Clear global IN NAK */

  regval = esp32s3_getreg(ESP32S3_OTG_DCTL);
  regval |= OTG_DCTL_CGINAK;
  esp32s3_putreg(regval, ESP32S3_OTG_DCTL);
}

/****************************************************************************
 * Name: esp32s3_ep0out_ctrlsetup
 *
 * Description:
 *   Setup to receive a SETUP packet.
 *
 ****************************************************************************/

static void esp32s3_ep0out_ctrlsetup(struct esp32s3_usbdev_s *priv)
{
  uint32_t regval;

  /* Setup the hardware to perform the SETUP transfer */

  regval = ((USB_SIZEOF_CTRLREQ * 3) << OTG_DOEPTSIZ0_XFRSIZ_SHIFT) |
           (OTG_DOEPTSIZ0_PKTCNT) |
           (3 << OTG_DOEPTSIZ0_STUPCNT_SHIFT);
  esp32s3_putreg(regval, ESP32S3_OTG_DOEPTSIZ(0));

  /* Then clear NAKing and enable the transfer */

  regval = esp32s3_getreg(ESP32S3_OTG_DOEPCTL(0));
  regval |= (OTG_DOEPCTL0_CNAK | OTG_DOEPCTL0_EPENA);
  esp32s3_putreg(regval, ESP32S3_OTG_DOEPCTL(0));
}

/****************************************************************************
 * Name: esp32s3_txfifo_write
 *
 * Description:
 *   Send data to the endpoint's TxFIFO.
 *
 ****************************************************************************/

static void esp32s3_txfifo_write(struct esp32s3_ep_s *privep,
                                 uint8_t *buf,
                                 int nbytes)
{
  uint32_t regaddr;
  uint32_t regval;
  int nwords;
  int i;

  /* Convert the number of bytes to words */

  nwords = (nbytes + 3) >> 2;

  /* Get the TxFIFO for this endpoint (same as the endpoint number) */

  regaddr = ESP32S3_OTG_DFIFO_DEP(privep->epphy);

  /* Then transfer each word to the TxFIFO */

  for (i = 0; i < nwords; i++)
    {
      /* Read four bytes from the source buffer (to avoid unaligned accesses)
       * and pack these into one 32-bit word (little endian).
       */

      regval = (uint32_t) *buf++;
      regval |= ((uint32_t) *buf++) << 8;
      regval |= ((uint32_t) *buf++) << 16;
      regval |= ((uint32_t) *buf++) << 24;

      /* Then write the packet data to the TxFIFO */

