apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_otg_device.c
      esp32s3_putreg(regval, regaddr);
    }
}

/****************************************************************************
 * Name: esp32s3_epin_transfer
 *
 * Description:
 *   Start the Tx data transfer
 *
 ****************************************************************************/

static void esp32s3_epin_transfer(struct esp32s3_ep_s *privep,
                                  uint8_t *buf,
                                  int nbytes)
{
  uint32_t pktcnt;
  uint32_t regval;

  /* Read the DIEPSIZx register */

  regval = esp32s3_getreg(ESP32S3_OTG_DIEPTSIZ(privep->epphy));

  /* Clear the XFRSIZ, PKTCNT, and MCNT field of the DIEPSIZx register */

  regval &= ~(OTG_DIEPTSIZ_XFRSIZ_MASK | OTG_DIEPTSIZ_PKTCNT_MASK |
              OTG_DIEPTSIZ_MCNT_MASK);

  /* Are we sending a zero length packet (ZLP) */

  if (nbytes == 0)
    {
      /* Yes.. leave the transfer size at zero and set the packet count to
       * 1
       */

      pktcnt = 1;
    }
  else
    {
      /* No.. Program the transfer size and packet count .  First calculate:
       * xfrsize = The total number of bytes to be sent. pktcnt = the number
       * of packets (of maxpacket bytes) required to perform the transfer.
       */

      pktcnt = ((uint32_t)nbytes + (privep->ep.maxpacket - 1)) /
               privep->ep.maxpacket;
    }

  /* Set the XFRSIZ and PKTCNT */

  regval |= (pktcnt << OTG_DIEPTSIZ_PKTCNT_SHIFT);
  regval |= ((uint32_t)nbytes << OTG_DIEPTSIZ_XFRSIZ_SHIFT);

  /* If this is an isochronous endpoint, then set the multi-count field to
   * the PKTCNT as well.
   */

  if (privep->eptype == USB_EP_ATTR_XFER_ISOC)
    {
      regval |= (pktcnt << OTG_DIEPTSIZ_MCNT_SHIFT);
    }

  /* Save DIEPSIZx register value */

  esp32s3_putreg(regval, ESP32S3_OTG_DIEPTSIZ(privep->epphy));

  /* Read the DIEPCTLx register */

  regval = esp32s3_getreg(ESP32S3_OTG_DIEPCTL(privep->epphy));

  /* If this is an isochronous endpoint, then set the even/odd frame bit the
   * DIEPCTLx register.
   */

  if (privep->eptype == USB_EP_ATTR_XFER_ISOC)
    {
      /* Check bit 0 of the frame number of the received SOF and set the
       * even/odd frame to match.
       */

      uint32_t status = esp32s3_getreg(ESP32S3_OTG_DSTS);
      if ((status & OTG_DSTS_SOFFN0) == OTG_DSTS_SOFFN_EVEN)
        {
          regval |= OTG_DIEPCTL_SEVNFRM;
        }
      else
        {
          regval |= OTG_DIEPCTL_SODDFRM;
        }
    }

  /* EP enable, IN data in FIFO */

  regval &= ~OTG_DIEPCTL_EPDIS;
  regval |= (OTG_DIEPCTL_CNAK | OTG_DIEPCTL_EPENA);
  esp32s3_putreg(regval, ESP32S3_OTG_DIEPCTL(privep->epphy));

  /* Transfer the data to the TxFIFO.  At this point, the caller has already
   * assured that there is sufficient space in the TxFIFO to hold the
   * transfer we can just blindly continue.
   */

  esp32s3_txfifo_write(privep, buf, nbytes);
}

/****************************************************************************
 * Name: esp32s3_epin_request
 *
 * Description:
 *   Begin or continue write request processing.
 *
 ****************************************************************************/

static void esp32s3_epin_request(struct esp32s3_usbdev_s *priv,
                                 struct esp32s3_ep_s *privep)
{
  struct esp32s3_req_s *privreq;
  uint32_t regaddr;
  uint32_t regval;
  uint8_t *buf;
  int nbytes;
  int nwords;
  int bytesleft;

  /* We get here in one of four possible ways.  From three interrupting
   * events:
   *
   * 1. From esp32s3_epin as part of the transfer complete interrupt
   *    processing This interrupt indicates that the last transfer has
   *    completed.
   * 2. As part of the ITTXFE interrupt processing.  That interrupt
   *    indicates that an IN token was received when the associated
   *    TxFIFO was empty.
   * 3. From esp32s3_epin_txfifoempty as part of the TXFE interrupt
   *    processing.  The TXFEinterrupt is only enabled when the TxFIFO
   *    is full and the software must wait for space to become available
   *    in the TxFIFO.
   *
   * And this function may be called immediately when the write request
   * is queued to start up the next transaction.
   *
   * 4. From esp32s3_ep_submit when a new write request is received WHILE
   *    the endpoint is not active (privep->active == false).
   */

  /* Check the request from the head of the endpoint request queue */

  privreq = esp32s3_rqpeek(privep);
  if (!privreq)
    {
      usbtrace(TRACE_DEVERROR(ESP32S3_TRACEERR_EPINREQEMPTY), privep->epphy);

      /* There is no TX transfer in progress and no new pending TX requests
       * to send.  To stop transmitting any data on a particular IN endpoint,
       * the application must set the IN NAK bit. To set this bit, the
       * following field must be programmed.
       */

      regaddr = ESP32S3_OTG_DIEPCTL(privep->epphy);
      regval = esp32s3_getreg(regaddr);
      regval |= OTG_DIEPCTL_SNAK;
      esp32s3_putreg(regval, regaddr);

      /* The endpoint is no longer active */

      privep->active = false;
      return;
    }

  uinfo("EP%d req=%p: len=%zu xfrd=%zu zlp=%d\n",
        privep->epphy, privreq, privreq->req.len,
        privreq->req.xfrd, privep->zlp);

  /* Check for a special case: If we are just starting a request (xfrd==0)
   * and the class driver is trying to send a zero-length packet (len==0).
   * Then set the ZLP flag so that the packet will be sent.
   */

  if (privreq->req.len == 0)
    {
      /* The ZLP flag is set TRUE whenever we want to force the driver to
       * send a zero-length-packet on the next pass through the loop (below).
       * The flag is cleared whenever a packet is sent in the loop below.
       */

      privep->zlp = true;
    }

  /* Add one more packet to the TxFIFO.  We will wait for the transfer
   * complete event before we add the next packet (or part of a packet to
   * the TxFIFO).
   * The documentation says that we can can multiple packets to the TxFIFO,
   * but it seems that we need to get the transfer complete event before we
   * can add the next (or maybe I have got something wrong?)
   */

