apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_otg_device.c
static void esp32s3_epout_request(struct esp32s3_usbdev_s *priv,
                                  struct esp32s3_ep_s *privep)
{
  struct esp32s3_req_s *privreq;
  uint32_t regaddr;
  uint32_t regval;
  uint32_t xfrsize;
  uint32_t pktcnt;

  /* Make sure that there is not already a pending request request.  If there
   * is, just return, leaving the newly received request in the request
   * queue.
   */

  if (!privep->active)
    {
      /* Loop until a valid request is found (or the request queue is empty).
       * The loop is only need to look at the request queue again is an
       * invalid read request is encountered.
       */

      for (; ; )
        {
          /* Get a reference to the request at the head of the endpoint's
           * request queue
           */

          privreq = esp32s3_rqpeek(privep);
          if (!privreq)
            {
              usbtrace(TRACE_DEVERROR(ESP32S3_TRACEERR_EPOUTQEMPTY),
                       privep->epphy);

              /* There are no read requests to be setup.  Configure the
               * hardware to NAK any incoming packets.  (This should already
               * be the case.  I think that the hardware will automatically
               * NAK after a transfer is completed until SNAK is cleared).
               */

              regaddr = ESP32S3_OTG_DOEPCTL(privep->epphy);
              regval = esp32s3_getreg(regaddr);
              regval |= OTG_DOEPCTL_SNAK;
              esp32s3_putreg(regval, regaddr);

              /* This endpoint is no longer actively transferring */

              privep->active = false;
              return;
            }

          uinfo("EP%d: len=%d\n", privep->epphy, privreq->req.len);

          /* Ignore any attempt to receive a zero length packet (this really
           * should not happen.
           */

          if (privreq->req.len <= 0)
            {
              usbtrace(TRACE_DEVERROR(ESP32S3_TRACEERR_EPOUTNULLPACKET), 0);
              esp32s3_req_complete(privep, OK);
            }

          /* Otherwise, we have a usable read request... break out of the
           * loop
           */

          else
            {
              break;
            }
        }

      /* Setup the pending read into the request buffer.  First calculate:
       *
       * pktcnt = the number of packets (of maxpacket bytes) required to
       *   perform the transfer.
       * xfrsize = The total number of bytes required (in units of maxpacket
       *   bytes).
       */

      pktcnt = (privreq->req.len + (privep->ep.maxpacket - 1)) /
               privep->ep.maxpacket;
      xfrsize = pktcnt * privep->ep.maxpacket;

      /* Then setup the hardware to perform this transfer */

      regaddr = ESP32S3_OTG_DOEPTSIZ(privep->epphy);
      regval = esp32s3_getreg(regaddr);
      regval &= ~(OTG_DOEPTSIZ_XFRSIZ_MASK | OTG_DOEPTSIZ_PKTCNT_MASK);
      regval |= (xfrsize << OTG_DOEPTSIZ_XFRSIZ_SHIFT);
      regval |= (pktcnt << OTG_DOEPTSIZ_PKTCNT_SHIFT);
      esp32s3_putreg(regval, regaddr);

      /* Then enable the transfer */

      regaddr = ESP32S3_OTG_DOEPCTL(privep->epphy);
      regval = esp32s3_getreg(regaddr);

      /* When an isochronous transfer is enabled the Even/Odd frame bit must
       * also be set appropriately.
       */

#ifdef CONFIG_USBDEV_ISOCHRONOUS
      if (privep->eptype == USB_EP_ATTR_XFER_ISOC)
        {
          if (privep->odd)
            {
              regval |= OTG_DOEPCTL_SODDFRM;
            }
          else
            {
              regval |= OTG_DOEPCTL_SEVNFRM;
            }
        }
#endif

      /* Clearing NAKing and enable the transfer. */

      regval |= (OTG_DOEPCTL_CNAK | OTG_DOEPCTL_EPENA);
      esp32s3_putreg(regval, regaddr);

      /* A transfer is now active on this endpoint */

      privep->active = true;

      /* EP0 is a special case.  We need to know when to switch back to
       * normal SETUP processing.
       */

      if (privep->epphy == EP0)
        {
          priv->ep0state = EP0STATE_DATA_OUT;
        }
    }
}

/****************************************************************************
 * Name: esp32s3_ep_flush
 *
 * Description:
 *   Flush any primed descriptors from this ep
 *
 ****************************************************************************/

static void esp32s3_ep_flush(struct esp32s3_ep_s *privep)
{
  if (privep->isin)
    {
      esp32s3_txfifo_flush(OTG_GRSTCTL_TXFNUM_D(privep->epphy));
    }
  else
    {
      esp32s3_rxfifo_flush();
    }
}

/****************************************************************************
 * Name: esp32s3_req_complete
 *
 * Description:
 *   Handle termination of the request at the head of the endpoint request
 *   queue.
 *
 ****************************************************************************/

static void esp32s3_req_complete(struct esp32s3_ep_s *privep,
                                 int16_t result)
{
  struct esp32s3_req_s *privreq;

  /* Remove the request at the head of the request list */

  privreq = esp32s3_req_remfirst(privep);
  DEBUGASSERT(privreq != NULL);

  /* If endpoint 0, temporarily reflect the state of protocol stalled in the
   * callback.
   */

  bool stalled = privep->stalled;
  if (privep->epphy == EP0)
    {
      privep->stalled = privep->dev->stalled;
    }

  /* Save the result in the request structure */

  privreq->req.result = result;

  /* Callback to the request completion handler */

  privreq->req.callback(&privep->ep, &privreq->req);

  /* Restore the stalled indication */

  privep->stalled = stalled;
}

/****************************************************************************
 * Name: esp32s3_req_cancel
 *
 * Description:
 *   Cancel all pending requests for an endpoint
 *
 ****************************************************************************/

static void esp32s3_req_cancel(struct esp32s3_ep_s *privep, int16_t status)
{
  if (!esp32s3_rqempty(privep))
    {
      esp32s3_ep_flush(privep);
    }

  while (!esp32s3_rqempty(privep))
    {
      usbtrace(TRACE_COMPLETE(privep->epphy),
               (esp32s3_rqpeek(privep))->req.xfrd);
      esp32s3_req_complete(privep, status);
    }
}

/****************************************************************************
 * Name: esp32s3_ep_findbyaddr
 *
 * Description:
 *   Find the physical endpoint structure corresponding to a logic endpoint
 *   address
 *
 ****************************************************************************/

