apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_otg_device.c
  /* Check for session end detected */

  regval = esp32s3_getreg(ESP32S3_OTG_GOTGINT);
  if ((regval & OTG_GOTGINT_SEDET) != 0)
    {
#  warning "Missing logic"
    }

  /* Clear OTG interrupt */

  esp32s3_putreg(regval, ESP32S3_OTG_GOTGINT);
}
#endif

/****************************************************************************
 * Name: esp32s3_usbinterrupt
 *
 * Description:
 *   USB interrupt handler
 *
 ****************************************************************************/

static int esp32s3_usbinterrupt(int irq, void *context, void *arg)
{
  /* At present, there is only a single OTG device support. Hence it is
   * pre-allocated as g_otghsdev.  However, in most code, the private data
   * structure will be referenced using the 'priv' pointer (rather than the
   * global data) in order to simplify any future support for multiple
   * devices.
   */

  struct esp32s3_usbdev_s *priv = &g_otghsdev;
  uint32_t regval;
  uint32_t reserved;

  usbtrace(TRACE_INTENTRY(ESP32S3_TRACEINTID_USB), 0);

  /* Assure that we are in device mode */

  DEBUGASSERT((esp32s3_getreg(ESP32S3_OTG_GINTSTS) & OTG_GINTSTS_CMOD) ==
              OTG_GINTSTS_DEVMODE);

  /* Get the state of all enabled interrupts.  We will do this repeatedly
   * some interrupts (like RXFLVL) will generate additional interrupting
   * events.
   */

  for (; ; )
    {
      /* Get the set of pending, un-masked interrupts */

      regval = esp32s3_getreg(ESP32S3_OTG_GINTSTS);
      reserved = (regval & OTG_GINT_RESERVED);
      regval &= esp32s3_getreg(ESP32S3_OTG_GINTMSK);

      /* With out modifying the reserved bits, acknowledge all **Writable**
       * pending irqs we will service below.
       */

      esp32s3_putreg(((regval | reserved) & OTG_GINT_RC_W1),
                     ESP32S3_OTG_GINTSTS);

      /* Break out of the loop when there are no further pending
       * (and unmasked) interrupts to be processes.
       */

      if (regval == 0)
        {
          break;
        }

      usbtrace(TRACE_INTDECODE(ESP32S3_TRACEINTID_INTPENDING),
               (uint16_t)regval);

      /* OUT endpoint interrupt. The core sets this bit to indicate that an
       * interrupt is pending on one of the OUT endpoints of the core.
       */

      if ((regval & OTG_GINT_OEP) != 0)
        {
          usbtrace(TRACE_INTDECODE(ESP32S3_TRACEINTID_EPOUT),
                   (uint16_t)regval);
          esp32s3_epout_interrupt(priv);
        }

      /* IN endpoint interrupt.  The core sets this bit to indicate that an
       * interrupt is pending on one of the IN endpoints of the core.
       */

      if ((regval & OTG_GINT_IEP) != 0)
        {
          usbtrace(TRACE_INTDECODE(ESP32S3_TRACEINTID_EPIN),
                   (uint16_t)regval);
          esp32s3_epin_interrupt(priv);
        }

      /* Host/device mode mismatch error interrupt */

#ifdef CONFIG_DEBUG_USB
      if ((regval & OTG_GINT_MMIS) != 0)
        {
          usbtrace(TRACE_INTDECODE(ESP32S3_TRACEINTID_MISMATCH),
                   (uint16_t)regval);
        }
#endif

      /* Resume/remote wakeup detected interrupt */

      if ((regval & OTG_GINT_WKUP) != 0)
        {
          usbtrace(TRACE_INTDECODE(ESP32S3_TRACEINTID_WAKEUP),
                   (uint16_t)regval);
          esp32s3_resumeinterrupt(priv);
        }

      /* USB suspend interrupt */

      if ((regval & OTG_GINT_USBSUSP) != 0)
        {
          usbtrace(TRACE_INTDECODE(ESP32S3_TRACEINTID_SUSPEND),
                   (uint16_t)regval);
          esp32s3_suspendinterrupt(priv);
        }

      /* Start of frame interrupt */

#ifdef CONFIG_USBDEV_SOFINTERRUPT
      if ((regval & OTG_GINT_SOF) != 0)
        {
          usbtrace(TRACE_INTDECODE(ESP32S3_TRACEINTID_SOF),
                   (uint16_t)regval);
          usbdev_sof_irq(&priv->usbdev, esp32s3_getframe(&priv->usbdev));
        }
#endif

      /* RxFIFO non-empty interrupt.  Indicates that there is at least one
       * packet pending to be read from the RxFIFO.
       */

      if ((regval & OTG_GINT_RXFLVL) != 0)
        {
          usbtrace(TRACE_INTDECODE(ESP32S3_TRACEINTID_RXFIFO),
                   (uint16_t)regval);
          esp32s3_rxinterrupt(priv);
        }

      /* USB reset interrupt */

      if ((regval & (OTG_GINT_USBRST | OTG_GINT_RSTDET)) != 0)
        {
          usbtrace(TRACE_INTDECODE(ESP32S3_TRACEINTID_DEVRESET),
                   (uint16_t)regval);

          /* Perform the device reset */

          esp32s3_usbreset(priv);
          usbtrace(TRACE_INTEXIT(ESP32S3_TRACEINTID_USB), 0);
          return OK;
        }

      /* Enumeration done interrupt */

      if ((regval & OTG_GINT_ENUMDNE) != 0)
        {
          usbtrace(TRACE_INTDECODE(ESP32S3_TRACEINTID_ENUMDNE),
                   (uint16_t)regval);
          esp32s3_enuminterrupt(priv);
        }

      /* Incomplete isochronous IN transfer interrupt.  When the core finds
       * non-empty any of the isochronous IN endpoint FIFOs scheduled for the
       * current frame non-empty, the core generates an IISOIXFR interrupt.
       */

#ifdef CONFIG_USBDEV_ISOCHRONOUS
      if ((regval & OTG_GINT_IISOIXFR) != 0)
        {
          usbtrace(TRACE_INTDECODE(ESP32S3_TRACEINTID_IISOIXFR),
                   (uint16_t)regval);
          esp32s3_isocininterrupt(priv);
        }

      /* Incomplete isochronous OUT transfer.  For isochronous OUT endpoints,
       * the XFRC interrupt may not always be asserted. If the core drops
       * isochronous OUT data packets, the application could fail to detect
       * the XFRC interrupt.  The incomplete Isochronous OUT data interrupt
       * indicates that an XFRC interrupt was not asserted on at least one of
       * the isochronous OUT endpoints. At this point, the endpoint with the
       * incomplete transfer remains enabled, but no active transfers remain
       * in progress on this endpoint on the USB.
       */

      if ((regval & OTG_GINT_IISOOXFR) != 0)
        {
          usbtrace(TRACE_INTDECODE(ESP32S3_TRACEINTID_IISOOXFR),
                   (uint16_t)regval);
          esp32s3_isocoutinterrupt(priv);
        }
#endif

      /* Session request/new session detected interrupt */

#ifdef CONFIG_USBDEV_VBUSSENSING
      if ((regval & OTG_GINT_SRQ) != 0)
        {
          usbtrace(TRACE_INTDECODE(ESP32S3_TRACEINTID_SRQ),
                   (uint16_t)regval);
          esp32s3_sessioninterrupt(priv);
        }

      /* OTG interrupt */

      if ((regval & OTG_GINT_OTG) != 0)
        {
          usbtrace(TRACE_INTDECODE(ESP32S3_TRACEINTID_OTG),
                   (uint16_t)regval);
          esp32s3_otginterrupt(priv);
        }
#endif
    }

  usbtrace(TRACE_INTEXIT(ESP32S3_TRACEINTID_USB), 0);
  return OK;
}

/****************************************************************************
 * Endpoint operations
 ****************************************************************************/

/****************************************************************************
 * Name: esp32s3_enablegonak
 *
 * Description:
 *   Enable global OUT NAK mode
 *
 ****************************************************************************/

static void esp32s3_enablegonak(struct esp32s3_ep_s *privep)
{
  uint32_t regval;

