apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_otg_device.c
      privep->ep.maxpacket = maxpacket;
      privep->eptype       = eptype;
      privep->stalled      = false;
      privep->active       = false;
      privep->zlp          = false;
    }

  /* Enable the interrupt for this endpoint */

  regval = esp32s3_getreg(ESP32S3_OTG_DAINTMSK);
  regval |= OTG_DAINT_IEP(privep->epphy);
  esp32s3_putreg(regval, ESP32S3_OTG_DAINTMSK);

  return OK;
}

/****************************************************************************
 * Name: esp32s3_ep_configure
 *
 * Description:
 *   Configure endpoint, making it usable
 *
 * Input Parameters:
 *   ep   - the struct usbdev_ep_s instance obtained from allocep()
 *   desc - A struct usb_epdesc_s instance describing the endpoint
 *   last - true if this this last endpoint to be configured.  Some hardware
 *          needs to take special action when all of the endpoints have been
 *          configured.
 *
 ****************************************************************************/

static int esp32s3_ep_configure(struct usbdev_ep_s *ep,
                                const struct usb_epdesc_s *desc,
                                bool last)
{
  struct esp32s3_ep_s *privep = (struct esp32s3_ep_s *)ep;
  uint16_t maxpacket;
  uint8_t eptype;
  int ret;

  usbtrace(TRACE_EPCONFIGURE, privep->epphy);
  DEBUGASSERT(desc->addr == ep->eplog);

  /* Initialize EP capabilities */

  maxpacket = GETUINT16(desc->mxpacketsize);
  eptype = desc->attr & USB_EP_ATTR_XFERTYPE_MASK;

  /* Setup Endpoint Control Register */

  if (privep->isin)
    {
      ret = esp32s3_epin_configure(privep, eptype, maxpacket);
    }
  else
    {
      ret = esp32s3_epout_configure(privep, eptype, maxpacket);
    }

  return ret;
}

/****************************************************************************
 * Name: esp32s3_ep0_configure
 *
 * Description:
 *   Reset Usb engine
 *
 ****************************************************************************/

static void esp32s3_ep0_configure(struct esp32s3_usbdev_s *priv)
{
  /* Enable EP0 IN and OUT */

  esp32s3_epin_configure(&priv->epin[EP0], USB_EP_ATTR_XFER_CONTROL,
                         ESP32S3_CDCACM_EP0MAXPACKET);
  esp32s3_epout_configure(&priv->epout[EP0], USB_EP_ATTR_XFER_CONTROL,
                          ESP32S3_CDCACM_EP0MAXPACKET);
}

/****************************************************************************
 * Name: esp32s3_epout_disable
 *
 * Description:
 *   Disable an OUT endpoint will no longer be used
 *
 ****************************************************************************/

static void esp32s3_epout_disable(struct esp32s3_ep_s *privep)
{
  uint32_t regaddr;
  uint32_t regval;
  irqstate_t flags;

  usbtrace(TRACE_EPDISABLE, privep->epphy);

  /* Is this an IN or an OUT endpoint */

  /* Before disabling any OUT endpoint, the application must enable Global
   * OUT NAK mode in the core.
   */

  flags = enter_critical_section();
  esp32s3_enablegonak(privep);

  /* Disable the required OUT endpoint by setting the EPDIS and SNAK bits int
   * DOECPTL register.
   */

  regaddr = ESP32S3_OTG_DOEPCTL(privep->epphy);
  regval = esp32s3_getreg(regaddr);
  regval &= ~OTG_DOEPCTL_USBAEP;
  regval |= (OTG_DOEPCTL_EPDIS | OTG_DOEPCTL_SNAK);
  esp32s3_putreg(regval, regaddr);

  /* Wait for the EPDISD interrupt which indicates that the OUT endpoint is
   * completely disabled.
   */

#if 0    /* Doesn't happen */
  regaddr = ESP32S3_OTG_DOEPINT(privep->epphy);
  while ((esp32s3_getreg(regaddr) & OTG_DOEPINT_EPDISD) == 0);
#else
  /* REVISIT: */

  up_udelay(10);
#endif

  /* Clear the EPDISD interrupt indication */

  esp32s3_putreg(OTG_DOEPINT_EPDISD, ESP32S3_OTG_DOEPINT(privep->epphy));

  /* Then disable the Global OUT NAK mode to continue receiving data from
   * other non-disabled OUT endpoints.
   */

  esp32s3_disablegonak(privep);

  /* Disable endpoint interrupts */

  regval = esp32s3_getreg(ESP32S3_OTG_DAINTMSK);
  regval &= ~OTG_DAINT_OEP(privep->epphy);
  esp32s3_putreg(regval, ESP32S3_OTG_DAINTMSK);

  /* Cancel any queued read requests */

  esp32s3_req_cancel(privep, -ESHUTDOWN);

  leave_critical_section(flags);
}

/****************************************************************************
 * Name: esp32s3_epin_disable
 *
 * Description:
 *   Disable an IN endpoint when it will no longer be used
 *
 ****************************************************************************/

static void esp32s3_epin_disable(struct esp32s3_ep_s *privep)
{
  uint32_t regaddr;
  uint32_t regval;
  irqstate_t flags;

  usbtrace(TRACE_EPDISABLE, privep->epphy);

  /* After USB reset, the endpoint will already be deactivated by the
   * hardware.
   * Trying to disable again will just hang in the wait.
   */

  regaddr = ESP32S3_OTG_DIEPCTL(privep->epphy);
  regval = esp32s3_getreg(regaddr);
  if ((regval & OTG_DIEPCTL_USBAEP) == 0)
    {
      return;
    }

  /* This INEPNE wait logic is suggested by reference manual, but seems to
   * get stuck to infinite loop.
   */

#if 0
  /* Make sure that there is no pending IPEPNE interrupt (because we are to
   * poll this bit below).
   */

  esp32s3_putreg(OTG_DIEPINT_INEPNE, ESP32S3_OTG_DIEPINT(privep->epphy));

  /* Set the endpoint in NAK mode */

  regaddr = ESP32S3_OTG_DIEPCTL(privep->epphy);
  regval = esp32s3_getreg(regaddr);
  regval &= ~OTG_DIEPCTL_USBAEP;
  regval |= (OTG_DIEPCTL_EPDIS | OTG_DIEPCTL_SNAK);
  esp32s3_putreg(regval, regaddr);

  /* Wait for the INEPNE interrupt that indicates that we are now in NAK
   * mode
   */

  regaddr = ESP32S3_OTG_DIEPINT(privep->epphy);
  while ((esp32s3_getreg(regaddr) & OTG_DIEPINT_INEPNE) == 0);

  /* Clear the INEPNE interrupt indication */

  esp32s3_putreg(OTG_DIEPINT_INEPNE, regaddr);
#endif

  /* Deactivate and disable the endpoint by setting the EPDIS and SNAK bits
   * the DIEPCTLx register.
   */

  flags = enter_critical_section();
  regaddr = ESP32S3_OTG_DIEPCTL(privep->epphy);
  regval = esp32s3_getreg(regaddr);
  regval &= ~OTG_DIEPCTL_USBAEP;
  regval |= (OTG_DIEPCTL_EPDIS | OTG_DIEPCTL_SNAK);
  esp32s3_putreg(regval, regaddr);

  /* Wait for the EPDISD interrupt which indicates that the IN endpoint is
   * completely disabled.
   */

  regaddr = ESP32S3_OTG_DIEPINT(privep->epphy);
  while ((esp32s3_getreg(regaddr) & OTG_DIEPINT_EPDISD) == 0);

