apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_otg_device.c
  /* Clear the EPDISD interrupt indication */

  regval = esp32s3_getreg(regaddr);
  regval |= OTG_DIEPINT_EPDISD;
  esp32s3_putreg(regval, regaddr);

  /* Flush any data remaining in the TxFIFO */

  esp32s3_txfifo_flush(OTG_GRSTCTL_TXFNUM_D(privep->epphy));

  /* Disable endpoint interrupts */

  regval = esp32s3_getreg(ESP32S3_OTG_DAINTMSK);
  regval &= ~OTG_DAINT_IEP(privep->epphy);
  esp32s3_putreg(regval, ESP32S3_OTG_DAINTMSK);

  /* Cancel any queued write requests */

  esp32s3_req_cancel(privep, -ESHUTDOWN);
  leave_critical_section(flags);
}

/****************************************************************************
 * Name: esp32s3_ep_disable
 *
 * Description:
 *   The endpoint will no longer be used
 *
 ****************************************************************************/

static int esp32s3_ep_disable(struct usbdev_ep_s *ep)
{
  struct esp32s3_ep_s *privep = (struct esp32s3_ep_s *)ep;

#ifdef CONFIG_DEBUG_FEATURES
  if (!ep)
    {
      usbtrace(TRACE_DEVERROR(ESP32S3_TRACEERR_INVALIDPARMS), 0);
      return -EINVAL;
    }
#endif

  usbtrace(TRACE_EPDISABLE, privep->epphy);

  /* Is this an IN or an OUT endpoint */

  if (privep->isin)
    {
      /* Disable the IN endpoint */

      esp32s3_epin_disable(privep);
    }
  else
    {
      /* Disable the OUT endpoint */

      esp32s3_epout_disable(privep);
    }

  return OK;
}

/****************************************************************************
 * Name: esp32s3_ep_allocreq
 *
 * Description:
 *   Allocate an I/O request
 *
 ****************************************************************************/

static struct usbdev_req_s *esp32s3_ep_allocreq(struct usbdev_ep_s *ep)
{
  struct esp32s3_req_s *privreq;

#ifdef CONFIG_DEBUG_FEATURES
  if (!ep)
    {
      usbtrace(TRACE_DEVERROR(ESP32S3_TRACEERR_INVALIDPARMS), 0);
      return NULL;
    }
#endif

  usbtrace(TRACE_EPALLOCREQ, ((struct esp32s3_ep_s *)ep)->epphy);

  privreq = kmm_zalloc(sizeof(struct esp32s3_req_s));
  if (!privreq)
    {
      usbtrace(TRACE_DEVERROR(ESP32S3_TRACEERR_ALLOCFAIL), 0);
      return NULL;
    }

  return &privreq->req;
}

/****************************************************************************
 * Name: esp32s3_ep_freereq
 *
 * Description:
 *   Free an I/O request
 *
 ****************************************************************************/

static void esp32s3_ep_freereq(struct usbdev_ep_s *ep,
                               struct usbdev_req_s *req)
{
  struct esp32s3_req_s *privreq = (struct esp32s3_req_s *)req;

#ifdef CONFIG_DEBUG_FEATURES
  if (!ep || !req)
    {
      usbtrace(TRACE_DEVERROR(ESP32S3_TRACEERR_INVALIDPARMS), 0);
      return;
    }
#endif

  usbtrace(TRACE_EPFREEREQ, ((struct esp32s3_ep_s *)ep)->epphy);
  kmm_free(privreq);
}

/****************************************************************************
 * Name: esp32s3_ep_allocbuffer
 *
 * Description:
 *   Allocate an I/O buffer
 *
 ****************************************************************************/

#ifdef CONFIG_USBDEV_DMA
static void *esp32s3_ep_allocbuffer(struct usbdev_ep_s *ep, uint16_t bytes)
{
  usbtrace(TRACE_EPALLOCBUFFER, ((struct esp32s3_ep_s *)ep)->epphy);

#  ifdef CONFIG_USBDEV_DMAMEMORY
  return usbdev_dma_alloc(bytes);
#  else
  return kmm_malloc(bytes);
#  endif
}
#endif

/****************************************************************************
 * Name: esp32s3_ep_freebuffer
 *
 * Description:
 *   Free an I/O buffer
 *
 ****************************************************************************/

#ifdef CONFIG_USBDEV_DMA
static void esp32s3_ep_freebuffer(struct usbdev_ep_s *ep, void *buf)
{
  usbtrace(TRACE_EPALLOCBUFFER, ((struct esp32s3_ep_s *)ep)->epphy);

#  ifdef CONFIG_USBDEV_DMAMEMORY
  usbdev_dma_free(buf);
#  else
  kmm_free(buf);
#  endif
}
#endif

/****************************************************************************
 * Name: esp32s3_ep_submit
 *
 * Description:
 *   Submit an I/O request to the endpoint
 *
 ****************************************************************************/

static int esp32s3_ep_submit(struct usbdev_ep_s *ep,
                             struct usbdev_req_s *req)
{
  struct esp32s3_req_s *privreq = (struct esp32s3_req_s *)req;
  struct esp32s3_ep_s *privep = (struct esp32s3_ep_s *)ep;
  struct esp32s3_usbdev_s *priv;
  irqstate_t flags;
  int ret = OK;

  /* Some sanity checking */

#ifdef CONFIG_DEBUG_FEATURES
  if (!req || !req->callback || !req->buf || !ep)
    {
      usbtrace(TRACE_DEVERROR(ESP32S3_TRACEERR_INVALIDPARMS), 0);
      uinfo("req=%p callback=%p buf=%p ep=%p\n",
            req, req->callback, req->buf, ep);
      return -EINVAL;
    }
#endif

  usbtrace(TRACE_EPSUBMIT, privep->epphy);
  priv = privep->dev;

#ifdef CONFIG_DEBUG_FEATURES
  if (!priv->driver)
    {
      usbtrace(TRACE_DEVERROR(ESP32S3_TRACEERR_NOTCONFIGURED),
               priv->usbdev.speed);
      return -ESHUTDOWN;
    }
#endif

  /* Handle the request from the class driver */

  req->result = -EINPROGRESS;
  req->xfrd = 0;

  /* Disable Interrupts */

  flags = enter_critical_section();

  /* If we are stalled, then drop all requests on the floor */

  if (privep->stalled)
    {
      ret = -EBUSY;
    }
  else
    {
      /* Add the new request to the request queue for the endpoint. */

      if (esp32s3_req_addlast(privep, privreq) && !privep->active)
        {
          /* If a request was added to an IN endpoint, then attempt to send
           * the request data buffer now.
           */

          if (privep->isin)
            {
              usbtrace(TRACE_INREQQUEUED(privep->epphy), privreq->req.len);

              /* If the endpoint is not busy with another write request, then
               * process the newly received write request now.
               */

              if (!privep->active)
                {
                  esp32s3_epin_request(priv, privep);
                }
            }

          /* If the request was added to an OUT endpoint, then attempt to
           * setup a read into the request data buffer now (this will,
           * of course, fail if there is already a read in place).
           */

          else
            {
              usbtrace(TRACE_OUTREQQUEUED(privep->epphy), privreq->req.len);
              esp32s3_epout_request(priv, privep);
            }
        }
    }

  leave_critical_section(flags);
  return ret;
}

/****************************************************************************
 * Name: esp32s3_ep_cancel
 *
 * Description:
 *   Cancel an I/O request previously sent to an endpoint
 *
 ****************************************************************************/

static int esp32s3_ep_cancel(struct usbdev_ep_s *ep,
                             struct usbdev_req_s *req)
{
  struct esp32s3_ep_s *privep = (struct esp32s3_ep_s *)ep;
  irqstate_t flags;

#ifdef CONFIG_DEBUG_FEATURES
  if (!ep || !req)
    {
      usbtrace(TRACE_DEVERROR(ESP32S3_TRACEERR_INVALIDPARMS), 0);
      return -EINVAL;
    }
#endif

  usbtrace(TRACE_EPCANCEL, privep->epphy);

  flags = enter_critical_section();

  /* FIXME: if the request is the first, then we need to flush the EP
   * otherwise just remove it from the list but ... all other
   * implementations cancel all requests ...
   */

  esp32s3_req_cancel(privep, -ESHUTDOWN);
  leave_critical_section(flags);
  return OK;
}

/****************************************************************************
 * Name: esp32s3_epout_setstall
 *
 * Description:
 *   Stall an OUT endpoint
 *
 ****************************************************************************/

static int esp32s3_epout_setstall(struct esp32s3_ep_s *privep)
{
#if 1
  /* This implementation follows the requirements from the ESP32-S3 reference
   * manual.
   */

  uint32_t regaddr;
  uint32_t regval;

  /* Put the core in the Global OUT NAK mode */

