apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_otg_device.c
  esp32s3_enablegonak(privep);

  /* Disable and STALL the OUT endpoint by setting the EPDIS and STALL bits
   * in the DOECPTL register.
   */

  regaddr = ESP32S3_OTG_DOEPCTL(privep->epphy);
  regval = esp32s3_getreg(regaddr);
  regval |= (OTG_DOEPCTL_EPDIS | OTG_DOEPCTL_STALL);
  esp32s3_putreg(regval, regaddr);

  /* Wait for the EPDISD interrupt which indicates that the OUT endpoint is
   * completely disabled.
   */

#  if 0    /* Doesn't happen */
  regaddr = ESP32S3_OTG_DOEPINT(privep->epphy);
  while ((esp32s3_getreg(regaddr) & OTG_DOEPINT_EPDISD) == 0);
#  else
  /* REVISIT: */

  up_udelay(10);
#  endif

  /* Disable Global OUT NAK mode */

  esp32s3_disablegonak(privep);

  /* The endpoint is now stalled */

  privep->stalled = true;
  return OK;
#else
  /* This implementation follows the STMicro code example. */

  /* REVISIT: */

  uint32_t regaddr;
  uint32_t regval;

  /* Stall the OUT endpoint by setting the STALL bit in the DOECPTL
   * register.
   */

  regaddr = ESP32S3_OTG_DOEPCTL(privep->epphy);
  regval = esp32s3_getreg(regaddr);
  regval |= OTG_DOEPCTL_STALL;
  esp32s3_putreg(regval, regaddr);

  /* The endpoint is now stalled */

  privep->stalled = true;
  return OK;
#endif
}

/****************************************************************************
 * Name: esp32s3_epin_setstall
 *
 * Description:
 *   Stall an IN endpoint
 *
 ****************************************************************************/

static int esp32s3_epin_setstall(struct esp32s3_ep_s *privep)
{
  uint32_t regaddr;
  uint32_t regval;

  /* Get the IN endpoint device control register */

  regaddr = ESP32S3_OTG_DIEPCTL(privep->epphy);
  regval = esp32s3_getreg(regaddr);

  /* Then stall the endpoint */

  regval |= OTG_DIEPCTL_STALL;
  esp32s3_putreg(regval, regaddr);

  /* The endpoint is now stalled */

  privep->stalled = true;
  return OK;
}

/****************************************************************************
 * Name: esp32s3_ep_setstall
 *
 * Description:
 *   Stall an endpoint
 *
 ****************************************************************************/

static int esp32s3_ep_setstall(struct esp32s3_ep_s *privep)
{
  usbtrace(TRACE_EPSTALL, privep->epphy);

  /* Is this an IN endpoint? */

  if (privep->isin == 1)
    {
      return esp32s3_epin_setstall(privep);
    }
  else
    {
      return esp32s3_epout_setstall(privep);
    }
}

/****************************************************************************
 * Name: esp32s3_ep_clrstall
 *
 * Description:
 *   Resume a stalled endpoint
 *
 ****************************************************************************/

static int esp32s3_ep_clrstall(struct esp32s3_ep_s *privep)
{
  uint32_t regaddr;
  uint32_t regval;
  uint32_t stallbit;
  uint32_t data0bit;

  usbtrace(TRACE_EPRESUME, privep->epphy);

  /* Is this an IN endpoint? */

  if (privep->isin == 1)
    {
      /* Clear the stall bit in the IN endpoint device control register */

      regaddr = ESP32S3_OTG_DIEPCTL(privep->epphy);
      stallbit = OTG_DIEPCTL_STALL;
      data0bit = OTG_DIEPCTL_SD0PID;
    }
  else
    {
      /* Clear the stall bit in the IN endpoint device control register */

      regaddr = ESP32S3_OTG_DOEPCTL(privep->epphy);
      stallbit = OTG_DOEPCTL_STALL;
      data0bit = OTG_DOEPCTL_SD0PID;
    }

  /* Clear the stall bit */

  regval = esp32s3_getreg(regaddr);
  regval &= ~stallbit;

  /* Set the DATA0 pid for interrupt and bulk endpoints */

  if (privep->eptype == USB_EP_ATTR_XFER_INT ||
      privep->eptype == USB_EP_ATTR_XFER_BULK)
    {
      /* Writing this bit sets the DATA0 PID */

      regval |= data0bit;
    }

  esp32s3_putreg(regval, regaddr);

  /* The endpoint is no longer stalled */

  privep->stalled = false;
  return OK;
}

/****************************************************************************
 * Name: esp32s3_ep_stall
 *
 * Description:
 *   Stall or resume an endpoint
 *
 ****************************************************************************/

static int esp32s3_ep_stall(struct usbdev_ep_s *ep, bool resume)
{
  struct esp32s3_ep_s *privep = (struct esp32s3_ep_s *)ep;
  irqstate_t flags;
  int ret;

  /* Set or clear the stall condition as requested */

  flags = enter_critical_section();
  if (resume)
    {
      ret = esp32s3_ep_clrstall(privep);
    }
  else
    {
      ret = esp32s3_ep_setstall(privep);
    }

  leave_critical_section(flags);

  return ret;
}

/****************************************************************************
 * Name: esp32s3_ep0_stall
 *
 * Description:
 *   Stall endpoint 0
 *
 ****************************************************************************/

static void esp32s3_ep0_stall(struct esp32s3_usbdev_s *priv)
{
  esp32s3_epin_setstall(&priv->epin[EP0]);
  esp32s3_epout_setstall(&priv->epout[EP0]);
  priv->stalled = true;
  esp32s3_ep0out_ctrlsetup(priv);
}

/****************************************************************************
 * Device operations
 ****************************************************************************/

/****************************************************************************
 * Name: esp32s3_ep_alloc
 *
 * Description:
 *   Allocate an endpoint matching the parameters.
 *
 * Input Parameters:
 *   eplog  - 7-bit logical endpoint number (direction bit ignored).  Zero
 *            means that any endpoint matching the other requirements will
 *            suffice.  The assigned endpoint can be found in the eplog
 *            field.
 *   in     - true: IN (device-to-host) endpoint requested
 *   eptype - Endpoint type.  One of {USB_EP_ATTR_XFER_ISOC,
 *            USB_EP_ATTR_XFER_BULK, USB_EP_ATTR_XFER_INT}
 *
 ****************************************************************************/

static struct usbdev_ep_s *esp32s3_ep_alloc(struct usbdev_s *dev,
                                            uint8_t eplog, bool in,
                                            uint8_t eptype)
{
  struct esp32s3_usbdev_s *priv = (struct esp32s3_usbdev_s *)dev;
  uint8_t epavail;
  irqstate_t flags;
  int epphy;
  int epno = 0;

