apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_otg_device.c
  usbtrace(TRACE_DEVALLOCEP, (uint16_t)eplog);

  /* Ignore any direction bits in the logical address */

  epphy = USB_EPNO(eplog);

  /* Get the set of available endpoints depending on the direction */

  flags = enter_critical_section();
  epavail = priv->epavail[in];

  /* A physical address of 0 means that any endpoint will do */

  if (epphy > 0)
    {
      /* Otherwise, we will return the endpoint structure only for the
       * requested 'logical' endpoint.  All of the other checks will still be
       * performed.
       *
       * First, verify that the logical endpoint is in the range supported by
       * the hardware.
       */

      if (epphy >= ESP32S3_ENDPOINT_NUM)
        {
          usbtrace(TRACE_DEVERROR(ESP32S3_TRACEERR_BADEPNO),
                   (uint16_t)epphy);
          return NULL;
        }

      /* Remove all of the candidate endpoints from the bitset except for the
       * this physical endpoint number.
       */

      epavail &= (1 << epphy);
    }

  /* Is there an available endpoint? */

  if (epavail)
    {
      /* Yes.. Select the lowest numbered endpoint in the set of available
       * endpoints.
       */

      for (epno = 1; epno < ESP32S3_ENDPOINT_NUM; epno++)
        {
          uint8_t bit = 1 << epno;
          if ((epavail & bit) != 0)
            {
              /* Mark the endpoint no longer available */

              priv->epavail[in] &= ~(1 << epno);

              /* And return the pointer to the standard endpoint structure */

              leave_critical_section(flags);
              return in ? &priv->epin[epno].ep : &priv->epout[epno].ep;
            }
        }

      /* We should not get here */
    }

  usbtrace(TRACE_DEVERROR(ESP32S3_TRACEERR_NOEP), (uint16_t)eplog);
  leave_critical_section(flags);
  return NULL;
}

/****************************************************************************
 * Name: esp32s3_ep_free
 *
 * Description:
 *   Free the previously allocated endpoint
 *
 ****************************************************************************/

static void esp32s3_ep_free(struct usbdev_s *dev,
                            struct usbdev_ep_s *ep)
{
  struct esp32s3_usbdev_s *priv = (struct esp32s3_usbdev_s *)dev;
  struct esp32s3_ep_s *privep = (struct esp32s3_ep_s *)ep;
  irqstate_t flags;

  usbtrace(TRACE_DEVFREEEP, (uint16_t)privep->epphy);

  if (priv && privep)
    {
      /* Mark the endpoint as available */

      flags = enter_critical_section();
      priv->epavail[privep->isin] |= (1 << privep->epphy);
      leave_critical_section(flags);
    }
}

/****************************************************************************
 * Name: esp32s3_getframe
 *
 * Description:
 *   Returns the current frame number
 *
 ****************************************************************************/

static int esp32s3_getframe(struct usbdev_s *dev)
{
  uint32_t regval;

  usbtrace(TRACE_DEVGETFRAME, 0);

  /* Return the last frame number of the last SOF detected by the hardware */

  regval = esp32s3_getreg(ESP32S3_OTG_DSTS);
  return (int)((regval & OTG_DSTS_SOFFN_MASK) >> OTG_DSTS_SOFFN_SHIFT);
}

/****************************************************************************
 * Name: esp32s3_wakeup
 *
 * Description:
 *   Exit suspend mode.
 *
 ****************************************************************************/

static int esp32s3_wakeup(struct usbdev_s *dev)
{
  struct esp32s3_usbdev_s *priv = (struct esp32s3_usbdev_s *)dev;
  uint32_t regval;
  irqstate_t flags;

  usbtrace(TRACE_DEVWAKEUP, 0);

  /* Is wakeup enabled? */

  flags = enter_critical_section();
  if (priv->wakeup)
    {
      /* Yes... is the core suspended? */

      regval = esp32s3_getreg(ESP32S3_OTG_DSTS);
      if ((regval & OTG_DSTS_SUSPSTS) != 0)
        {
          /* Re-start the PHY clock and un-gate USB core clock (HCLK) */

#ifdef CONFIG_USBDEV_LOWPOWER
          regval = esp32s3_getreg(ESP32S3_OTG_PCGCCTL);
          regval &= ~(OTG_PCGCCTL_STPPCLK | OTG_PCGCCTL_GATEHCLK);
          esp32s3_putreg(regval, ESP32S3_OTG_PCGCCTL);
#endif
          /* Activate Remote wakeup signaling */

          regval = esp32s3_getreg(ESP32S3_OTG_DCTL);
          regval |= OTG_DCTL_RWUSIG;
          esp32s3_putreg(regval, ESP32S3_OTG_DCTL);
          up_mdelay(5);
          regval &= ~OTG_DCTL_RWUSIG;
          esp32s3_putreg(regval, ESP32S3_OTG_DCTL);
        }
    }

  leave_critical_section(flags);
  return OK;
}

/****************************************************************************
 * Name: esp32s3_selfpowered
 *
 * Description:
 *   Sets/clears the device self-powered feature
 *
 ****************************************************************************/

static int esp32s3_selfpowered(struct usbdev_s *dev, bool selfpowered)
{
  struct esp32s3_usbdev_s *priv = (struct esp32s3_usbdev_s *)dev;

  usbtrace(TRACE_DEVSELFPOWERED, (uint16_t)selfpowered);

#ifdef CONFIG_DEBUG_FEATURES
  if (!dev)
    {
      usbtrace(TRACE_DEVERROR(ESP32S3_TRACEERR_INVALIDPARMS), 0);
      return -ENODEV;
    }
#endif

  priv->selfpowered = selfpowered;
  return OK;
}

/****************************************************************************
 * Name: esp32s3_pullup
 *
 * Description:
 *   Software-controlled connect to/disconnect from USB host
 *
 ****************************************************************************/

static int esp32s3_pullup(struct usbdev_s *dev, bool enable)
{
  uint32_t regval;

  usbtrace(TRACE_DEVPULLUP, (uint16_t)enable);

  irqstate_t flags = enter_critical_section();
  if (enable)
    {
      /* Connect the device by clearing the soft disconnect bit in the DCTL
       * register.
       */

      regval = esp32s3_getreg(ESP32S3_OTG_DCTL);
      regval &= ~OTG_DCTL_SDIS;
      esp32s3_putreg(regval, ESP32S3_OTG_DCTL);

      /* Set DP pull-up */

      regval  = esp32s3_getreg(USB_WRAP_OTG_CONF_REG);
      regval &= ~USB_WRAP_DP_PULLDOWN;
      regval |= USB_WRAP_DP_PULLUP;
      esp32s3_putreg(regval, USB_WRAP_OTG_CONF_REG);
    }
  else
    {
      /* Disconnect the device by setting the soft disconnect bit in the DCTL
       * register.
       */

      regval = esp32s3_getreg(ESP32S3_OTG_DCTL);
      regval |= OTG_DCTL_SDIS;
      esp32s3_putreg(regval, ESP32S3_OTG_DCTL);

      /* Set DP pull-down */

      regval  = esp32s3_getreg(USB_WRAP_OTG_CONF_REG);
      regval &= ~USB_WRAP_DP_PULLUP;
      regval |= USB_WRAP_DP_PULLDOWN;
      esp32s3_putreg(regval, USB_WRAP_OTG_CONF_REG);
    }

  leave_critical_section(flags);
  return OK;
}

/****************************************************************************
 * Name: esp32s3_setaddress
 *
 * Description:
 *   Set the devices USB address
 *
 ****************************************************************************/

static void esp32s3_setaddress(struct esp32s3_usbdev_s *priv,
                               uint16_t address)
{
  uint32_t regval;

  /* Set the device address in the DCFG register */

  regval = esp32s3_getreg(ESP32S3_OTG_DCFG);
  regval &= ~OTG_DCFG_DAD_MASK;
  regval |= ((uint32_t)address << OTG_DCFG_DAD_SHIFT);
  esp32s3_putreg(regval, ESP32S3_OTG_DCFG);

  /* Are we now addressed? (i.e., do we have a non-NULL device address?) */

  if (address != 0)
    {
      priv->devstate = DEVSTATE_ADDRESSED;
      priv->addressed = true;
    }
  else
    {
      priv->devstate = DEVSTATE_DEFAULT;
      priv->addressed = false;
    }
}

/****************************************************************************
 * Name: esp32s3_txfifo_flush
 *
 * Description:
 *   Flush the specific TX fifo.
 *
 ****************************************************************************/

static int esp32s3_txfifo_flush(uint32_t txfnum)
{
  uint32_t regval;
  uint32_t timeout;

  /* Initiate the TX FIFO flush operation */

  regval = OTG_GRSTCTL_TXFFLSH | txfnum;
  esp32s3_putreg(regval, ESP32S3_OTG_GRSTCTL);

  /* Wait for the FLUSH to complete */

  for (timeout = 0; timeout < ESP32S3_FLUSH_DELAY; timeout++)
    {
      regval = esp32s3_getreg(ESP32S3_OTG_GRSTCTL);
      if ((regval & OTG_GRSTCTL_TXFFLSH) == 0)
        {
          break;
        }
    }

