apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_otg_device.c
  /* Wait for 3 PHY Clocks */

  up_udelay(3);
  return OK;
}

/****************************************************************************
 * Name: esp32s3_rxfifo_flush
 *
 * Description:
 *   Flush the RX fifo.
 *
 ****************************************************************************/

static int esp32s3_rxfifo_flush(void)
{
  uint32_t regval;
  uint32_t timeout;

  /* Initiate the RX FIFO flush operation */

  esp32s3_putreg(OTG_GRSTCTL_RXFFLSH, ESP32S3_OTG_GRSTCTL);

  /* Wait for the FLUSH to complete */

  for (timeout = 0; timeout < ESP32S3_FLUSH_DELAY; timeout++)
    {
      regval = esp32s3_getreg(ESP32S3_OTG_GRSTCTL);
      if ((regval & OTG_GRSTCTL_RXFFLSH) == 0)
        {
          break;
        }
    }

  /* Wait for 3 PHY Clocks */

  up_udelay(3);
  return OK;
}

/****************************************************************************
 * Name: esp32s3_swinitialize
 *
 * Description:
 *   Initialize all driver data structures.
 *
 ****************************************************************************/

static void esp32s3_swinitialize(struct esp32s3_usbdev_s *priv)
{
  struct esp32s3_ep_s *privep;
  int i;

  /* Initialize the device state structure */

  memset(priv, 0, sizeof(struct esp32s3_usbdev_s));

  priv->usbdev.ops = &g_devops;
  priv->usbdev.ep0 = &priv->epin[EP0].ep;

  priv->epavail[0] = ESP32S3_EP_AVAILABLE;
  priv->epavail[1] = ESP32S3_EP_AVAILABLE;

  /* Initialize the endpoint lists */

  for (i = 0; i < ESP32S3_ENDPOINT_NUM; i++)
    {
      /* Set endpoint operations, reference to driver structure (not really
       * necessary because there is only one controller), and the physical
       * endpoint number (which is just the index to the endpoint).
       */

      privep = &priv->epin[i];
      privep->ep.ops = &g_epops;
      privep->dev = priv;
      privep->isin = 1;

      /* The index, i, is the physical endpoint address; Map this to a
       * logical endpoint address usable by the class driver.
       */

      privep->epphy = i;
      privep->ep.eplog = ESP32S3_EPPHYIN2LOG(i);

      /* Control until endpoint is activated */

      privep->eptype = USB_EP_ATTR_XFER_CONTROL;
      privep->ep.maxpacket = ESP32S3_CDCACM_EP0MAXPACKET;
    }

  /* Initialize the endpoint lists */

  for (i = 0; i < ESP32S3_ENDPOINT_NUM; i++)
    {
      /* Set endpoint operations, reference to driver structure (not really
       * necessary because there is only one controller), and the physical
       * endpoint number (which is just the index to the endpoint).
       */

      privep = &priv->epout[i];
      privep->ep.ops = &g_epops;
      privep->dev = priv;

      /* The index, i, is the physical endpoint address; Map this to a
       * logical endpoint address usable by the class driver.
       */

      privep->epphy = i;
      privep->ep.eplog = ESP32S3_EPPHYOUT2LOG(i);

      /* Control until endpoint is activated */

      privep->eptype = USB_EP_ATTR_XFER_CONTROL;
      privep->ep.maxpacket = ESP32S3_CDCACM_EP0MAXPACKET;
    }
}

/****************************************************************************
 * Name: esp32s3_hwinitialize
 *
 * Description:
 *   Configure the OTG  core for operation.
 *
 ****************************************************************************/

static void esp32s3_hwinitialize(struct esp32s3_usbdev_s *priv)
{
  uint32_t regval;
  uint32_t timeout;
  uint32_t address;
  int i;

  /* Enable USB clock and disable reset */

  regval  = esp32s3_getreg(SYSTEM_PERIP_CLK_EN0_REG);
  regval |= SYSTEM_USB_CLK_EN;
  esp32s3_putreg(regval, SYSTEM_PERIP_CLK_EN0_REG);

  regval  = esp32s3_getreg(SYSTEM_PERIP_RST_EN0_REG);
  regval &= ~SYSTEM_USB_RST;
  esp32s3_putreg(regval, SYSTEM_PERIP_RST_EN0_REG);

  /* Configure USB PHY */

  regval  = esp32s3_getreg(RTC_CNTL_USB_CONF_REG);
  regval |= RTC_CNTL_SW_HW_USB_PHY_SEL | RTC_CNTL_SW_USB_PHY_SEL;
  esp32s3_putreg(regval, RTC_CNTL_USB_CONF_REG);

  /* Set USB DM and DP pin pull-down */

  regval  = esp32s3_getreg(USB_WRAP_OTG_CONF_REG);
  regval &= ~(USB_WRAP_PHY_SEL | USB_WRAP_DP_PULLUP | USB_WRAP_DM_PULLUP);
  regval |= USB_WRAP_PAD_PULL_OVERRIDE | USB_WRAP_DP_PULLDOWN |
            USB_WRAP_DM_PULLDOWN | USB_WRAP_USB_PAD_ENABLE;
  esp32s3_putreg(regval, USB_WRAP_OTG_CONF_REG);

  /* At start-up the core is in FS mode. */

  /* Disable global interrupts by clearing the GINTMASK bit in the GAHBCFG
   * register; Set the TXFELVL bit in the GAHBCFG register so that TxFIFO
   * interrupts will occur when the TxFIFO is truly empty (not just half
   * full).
   */

  esp32s3_putreg(OTG_GAHBCFG_TXFELVL, ESP32S3_OTG_GAHBCFG);

  /* Common USB OTG core initialization */

  /* Reset after a PHY select and set Host mode.  First, wait for AHB master
   * IDLE state.
   */

  for (timeout = 0; timeout < ESP32S3_READY_DELAY; timeout++)
    {
      up_udelay(3);
      regval = esp32s3_getreg(ESP32S3_OTG_GRSTCTL);
      if ((regval & OTG_GRSTCTL_AHBIDL) != 0)
        {
          break;
        }
    }

  /* Then perform the core soft reset. */

  regval = esp32s3_getreg(ESP32S3_OTG_GRSTCTL);
  regval |= OTG_GRSTCTL_CSRST;
  esp32s3_putreg(regval, ESP32S3_OTG_GRSTCTL);
  for (timeout = 0; timeout < ESP32S3_READY_DELAY; timeout++)
    {
      regval = esp32s3_getreg(ESP32S3_OTG_GRSTCTL);
      if ((regval & OTG_GRSTCTL_CSRST) == 0)
        {
          break;
        }
    }

  /* Wait for 3 PHY Clocks */

  up_udelay(3);

  /* Deactivate the power down */

  /* Detection Enable when set */

  regval = esp32s3_getreg(ESP32S3_OTG_GCCFG);

  regval |= OTG_GCCFG_PWRDWN;

#ifdef CONFIG_USBDEV_VBUSSENSING
  regval |= OTG_GCCFG_VBDEN;
#endif

  esp32s3_putreg(regval, ESP32S3_OTG_GCCFG);
  up_mdelay(20);

  /* When VBUS sensing is not used we need to force the B session valid */

#ifndef CONFIG_USBDEV_VBUSSENSING
  regval = esp32s3_getreg(ESP32S3_OTG_GOTGCTL);
  regval |= (OTG_GOTGCTL_BVALOEN | OTG_GOTGCTL_BVALOVAL);
  esp32s3_putreg(regval, ESP32S3_OTG_GOTGCTL);
#endif

  /* Force Device Mode */

  regval = esp32s3_getreg(ESP32S3_OTG_GUSBCFG);
  regval &= ~OTG_GUSBCFG_FHMOD;
  regval |= OTG_GUSBCFG_FDMOD;
  esp32s3_putreg(regval, ESP32S3_OTG_GUSBCFG);
  up_mdelay(50);

  /* Initialize device mode */

  /* Restart the PHY Clock */

  esp32s3_putreg(0, ESP32S3_OTG_PCGCCTL);

  /* Device configuration register */

  regval = esp32s3_getreg(ESP32S3_OTG_DCFG);
  regval &= ~OTG_DCFG_PFIVL_MASK;
  regval |= OTG_DCFG_PFIVL_80PCT;
  esp32s3_putreg(regval, ESP32S3_OTG_DCFG);

  /* Set PHY speed */

  regval = esp32s3_getreg(ESP32S3_OTG_DCFG);
  regval &= ~OTG_DCFG_DSPD_MASK;
  regval |= OTG_DCFG_DSPD_FS;
  esp32s3_putreg(regval, ESP32S3_OTG_DCFG);

