apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_otg_device.c
  /* Set Rx FIFO size */

  esp32s3_putreg(ESP32S3_RXFIFO_WORDS, ESP32S3_OTG_GRXFSIZ);

#if ESP32S3_ENDPOINT_NUM > 0
  address = ESP32S3_RXFIFO_WORDS;
  regval = (address << OTG_DIEPTXF0_TX0FD_SHIFT) |
    (ESP32S3_EP0_TXFIFO_WORDS << OTG_DIEPTXF0_TX0FSA_SHIFT);
  esp32s3_putreg(regval, ESP32S3_OTG_DIEPTXF0);
#endif

#if ESP32S3_ENDPOINT_NUM > 1
  address += ESP32S3_EP0_TXFIFO_WORDS;
  regval = (address << OTG_DIEPTXF_INEPTXSA_SHIFT) |
    (ESP32S3_EP1_TXFIFO_WORDS << OTG_DIEPTXF_INEPTXFD_SHIFT);
  esp32s3_putreg(regval, ESP32S3_OTG_DIEPTXF(1));
#endif

#if ESP32S3_ENDPOINT_NUM > 2
  address += ESP32S3_EP1_TXFIFO_WORDS;
  regval = (address << OTG_DIEPTXF_INEPTXSA_SHIFT) |
    (ESP32S3_EP2_TXFIFO_WORDS << OTG_DIEPTXF_INEPTXFD_SHIFT);
  esp32s3_putreg(regval, ESP32S3_OTG_DIEPTXF(2));
#endif

#if ESP32S3_ENDPOINT_NUM > 3
  address += ESP32S3_EP2_TXFIFO_WORDS;
  regval = (address << OTG_DIEPTXF_INEPTXSA_SHIFT) |
    (ESP32S3_EP3_TXFIFO_WORDS << OTG_DIEPTXF_INEPTXFD_SHIFT);
  esp32s3_putreg(regval, ESP32S3_OTG_DIEPTXF(3));
#endif

#if ESP32S3_ENDPOINT_NUM > 4
  address += ESP32S3_EP3_TXFIFO_WORDS;
  regval = (address << OTG_DIEPTXF_INEPTXSA_SHIFT) |
    (ESP32S3_EP4_TXFIFO_WORDS << OTG_DIEPTXF_INEPTXFD_SHIFT);
  esp32s3_putreg(regval, ESP32S3_OTG_DIEPTXF(4));
#endif

#if ESP32S3_ENDPOINT_NUM > 5
  address += ESP32S3_EP4_TXFIFO_WORDS;
  regval = (address << OTG_DIEPTXF_INEPTXSA_SHIFT) |
    (ESP32S3_EP5_TXFIFO_WORDS << OTG_DIEPTXF_INEPTXFD_SHIFT);
  esp32s3_putreg(regval, ESP32S3_OTG_DIEPTXF(5));
#endif

#if ESP32S3_ENDPOINT_NUM > 6
  address += ESP32S3_EP5_TXFIFO_WORDS;
  regval = (address << OTG_DIEPTXF_INEPTXSA_SHIFT) |
    (ESP32S3_EP6_TXFIFO_WORDS << OTG_DIEPTXF_INEPTXFD_SHIFT);
  esp32s3_putreg(regval, ESP32S3_OTG_DIEPTXF(6));
#endif

  /* Flush the FIFOs */

  esp32s3_txfifo_flush(OTG_GRSTCTL_TXFNUM_DALL);
  esp32s3_rxfifo_flush();

  /* Clear all pending Device Interrupts */

  esp32s3_putreg(0, ESP32S3_OTG_DIEPMSK);
  esp32s3_putreg(0, ESP32S3_OTG_DOEPMSK);
  esp32s3_putreg(0, ESP32S3_OTG_DIEPEMPMSK);
  esp32s3_putreg(0xffffffff, ESP32S3_OTG_DAINT);
  esp32s3_putreg(0, ESP32S3_OTG_DAINTMSK);

  /* Configure all IN endpoints */

  for (i = 0; i < ESP32S3_ENDPOINT_NUM; i++)
    {
      regval = esp32s3_getreg(ESP32S3_OTG_DIEPCTL(i));
      if ((regval & OTG_DIEPCTL_EPENA) != 0)
        {
          /* The endpoint is already enabled */

          regval = OTG_DIEPCTL_EPDIS | OTG_DIEPCTL_SNAK;
        }
      else
        {
          regval = 0;
        }

      esp32s3_putreg(regval, ESP32S3_OTG_DIEPCTL(i));
      esp32s3_putreg(0, ESP32S3_OTG_DIEPTSIZ(i));
      esp32s3_putreg(0xff, ESP32S3_OTG_DIEPINT(i));
    }

  /* Configure all OUT endpoints */

  for (i = 0; i < ESP32S3_ENDPOINT_NUM; i++)
    {
      regval = esp32s3_getreg(ESP32S3_OTG_DOEPCTL(i));
      if ((regval & OTG_DOEPCTL_EPENA) != 0)
        {
          /* The endpoint is already enabled */

          regval = OTG_DOEPCTL_EPDIS | OTG_DOEPCTL_SNAK;
        }
      else
        {
          regval = 0;
        }

      esp32s3_putreg(regval, ESP32S3_OTG_DOEPCTL(i));
      esp32s3_putreg(0, ESP32S3_OTG_DOEPTSIZ(i));
      esp32s3_putreg(0xff, ESP32S3_OTG_DOEPINT(i));
    }

  /* Disable all interrupts. */

  esp32s3_putreg(0, ESP32S3_OTG_GINTMSK);

  /* Clear any pending USB_OTG Interrupts */

  esp32s3_putreg(0xffffffff, ESP32S3_OTG_GOTGINT);

  /* Clear any pending interrupts */

  regval = esp32s3_getreg(ESP32S3_OTG_GINTSTS);
  regval &= OTG_GINT_RESERVED;
  esp32s3_putreg(regval | OTG_GINT_RC_W1, ESP32S3_OTG_GINTSTS);

  /* Enable the interrupts in the INTMSK */

  regval = (OTG_GINT_RXFLVL | OTG_GINT_USBSUSP | OTG_GINT_WKUP |
            OTG_GINT_ENUMDNE | OTG_GINT_IEP | OTG_GINT_OEP |
            OTG_GINT_USBRST);

#ifdef CONFIG_USBDEV_ISOCHRONOUS
  regval |= (OTG_GINT_IISOIXFR | OTG_GINT_IISOOXFR);
#endif

#ifdef CONFIG_USBDEV_SOFINTERRUPT
  regval |= OTG_GINT_SOF;
#endif

#ifdef CONFIG_USBDEV_VBUSSENSING
  regval |= (OTG_GINT_OTG | OTG_GINT_SRQ);
#endif

#ifdef CONFIG_DEBUG_USB
  regval |= OTG_GINT_MMIS;
#endif

  esp32s3_putreg(regval, ESP32S3_OTG_GINTMSK);

  /* Enable the USB global interrupt by setting GINTMSK in the global OTG AHB
   * configuration register; Set the TXFELVL bit in the GAHBCFG register so
   * that TxFIFO interrupts will occur when the TxFIFO is truly empty (not
   * just half full).
   */

  esp32s3_putreg(OTG_GAHBCFG_GINTMSK | OTG_GAHBCFG_TXFELVL,
                 ESP32S3_OTG_GAHBCFG);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: xtensa_usbinitialize
 *
 * Description:
 *   Initialize USB hardware.
 *
 * Assumptions:
 * - This function is called very early in the initialization sequence
 *
 ****************************************************************************/

void xtensa_usbinitialize(void)
{
  /* At present, there is only a single OTG device support. Hence it is
   * pre-allocated as g_otghsdev.  However, in most code, the private data
   * structure will be referenced using the 'priv' pointer (rather than the
   * global data) in order to simplify any future support for multiple
   * devices.
   */

  struct esp32s3_usbdev_s *priv = &g_otghsdev;
  int ret;

  usbtrace(TRACE_DEVINIT, 0);

  /* Here we assume that: 1. GPIOA and OTG peripheral clocking has already
   * been enabled as part of the boot sequence. 2. Board-specific logic has
   * already enabled other board specific GPIOs for things like soft pull-up,
   * VBUS sensing, power controls, and over- current detection.
   */

  /* Configure OTG alternate function pins */

  esp_configgpio(USB_IOMUX_DM, DRIVE_3);
  esp_configgpio(USB_IOMUX_DP, DRIVE_3);

  /* USB_OTG_IDDIG_IN_IDX:     connected connector is mini-B side
   * USB_SRP_BVALID_IN_IDX:    HIGH to force USB device mode
   * USB_OTG_VBUSVALID_IN_IDX: receiving a valid Vbus from device
   * USB_OTG_AVALID_IN_IDX:    HIGH to force USB host mode
   */

  esp_gpio_matrix_in(MATRIX_DETACH_IN_LOW_HIGH,
                         USB_OTG_IDDIG_IN_IDX,
                         false);
  esp_gpio_matrix_in(MATRIX_DETACH_IN_LOW_HIGH,
                         USB_SRP_BVALID_IN_IDX,
                         false);
  esp_gpio_matrix_in(MATRIX_DETACH_IN_LOW_HIGH,
                         USB_OTG_VBUSVALID_IN_IDX,
                         false);
  esp_gpio_matrix_in(MATRIX_DETACH_IN_LOW_PIN,
                         USB_OTG_AVALID_IN_IDX,
                         false);

  /* Uninitialize the hardware so that we know that we are starting from a
   * known state.
   */

